{
    "p1": "The 1949 North Augusta High School baseball season led by Coach Ed Stillwell was an exceptional and triumphant one.  This was the first time in NA history the baseball team won the State Championship.",
    "p2": "The District 3 Champions made short order of Wagener, Graniteville and LBC to advance to the state playoffs.  The pitching crew included Donald Metz, Marion Thompson, John Gibbs and Hunter Henry all throwing to battery mate Billy Norrell, a hard hitting catcher with an accurate, rocket arm that rarely allowed a stolen base.",
    "p3": "The championship quest began against Saluda High with the Jackets dropping Game One 4-2.  Game 2 was rained out for 4 straight days before the Jackets finally swept Saluda 6-4 and a whopping 20-4 in the final.  Pitchers Henry and Thompson again completed the pitching duties for North Augusta.",
    "p4": "Round 2 was against Olympia High School with the Jackets sweeping the best of three playoffs 10 – 3 and 11-7.  Marion Thompson relieved starting pitcher John Gibbs after just one inning giving up just 4 hits and striking out 6.  Earl Baynham and Billy Humphries each had two hits and 3 RBI with Baynham adding a triple and Tommy Griffin and Donald Metz with a double each.  Game 2 saw the Jackets explode for 7 runs in the second inning to never trail, knocking out 15 hits in the deciding game.  Thompson went 4-4, Metz added a 2 run homer and Baynham added 3 hits of his own.  Winning pitcher Hunter Henry held the opposition to just 1 run over the first 7 innings of play.",
    "p5": "Round 3 had NA pitted against Jonesville and saw the Jackets drop Game 1 6-0 at home.  They traveled to Jonesville the next day to record a 3-2 victory behind the steady pitching of Hunter Henry and a 5-5 performance from Earl Baynham.  The final game was played at Newberry College, the Jackets prevailing 10-4 behind pitcher Marion Thompson and another 4 hit performance by Baynham, plus 3 hits by TH Payne.",
    "p6": "Advancing to the Upper State finals against Duncan, North Augusta saw Thompson throw a 4 hit shutout in Game 1 with Metz and Williams adding a 2 run homerun each for a 9-0 victory.  Henry and Donald Metz shared the pitching duties in the deciding game that saw Humphries tally 4 hits in the 7-6 win for North Augusta.",
    "p7": "The State finals were against Cheraw High School led by future major leaguer Tom Brewer, whose major league career included 8 years with the Boston Red Sox, an all-star nomination in 1956 and two opening day starts.  Tom Brewer Field is now in Cheraw, SC.  Brewer led his team to a 6-5 victory in Game 1 despite a great pitching and hitting performance by Donald Metz and hitters Humphries and Norrell.  Metz returned to pitch a 4 hitter in Game 2 and saw NA never trail in the contest, setting up the state final at the University of South Carolina Field on May 26.  The fired up Jackets scored early and often, leading winning pitcher Thompson to a 12-2 victory and the 1949 State Championship.  The entire squad contributed to a memorable season and also included Carl Canipe, Buddy Metz, Robert Singeltary, Lloyd McNair, George Logan and Tommy Griffin."
}