{
    "p1": "The 1958 North Augusta High School football team may have been the finest collection of players ever assembled in South Carolina football history. Entering the season with a 35 game unbeaten streak, the Yellow Jackets gave up only 19 points in their first six games to reach 41 straight, then defeated Orangeburg to have the longest unbeaten streak in South Carolina or Georgia football history at 42 straight games. Although a tough Greenville team halted the streak by the slim margin of 14 - 13, consecutive convincing wins over Aiken (26-0), Clinton (33-12) and Lancaster (19-0) brought home the Class AA Championship to North Augusta. Head Coach Cally Gault, and assistants Jim Buist and Webster Grayson led the team during this outstanding season.",
    "p2": "The seniors on this team lost only one game in their entire high school career. Outsized by many opponents, the tenacity of the players and the drive to never give up, to play at full speed on every play, etched their names in North Augusta sports history. The community followed the team faithfully, often bringing more people to the visitor’s games then the home team. The previous year’s undefeated teams were not invited to play in the state playoffs, but could not be ignored after the memorable unbeaten streak. The 1958 team will long be remembered as the team that rose above all opponents and collectively, remain one of the best teams ever assembled in South Carolina high school football history.",
    "p3": "“They are my favorite team of all the teams I’ve coached.” And that briefly sums up the way Cally Gault regards his 1958 North Augusta High School football team, which Thanksgiving night won the school’s first football championship, the Class AA crown.",
    "p4": "Wayne Brinkley, Sammy Anderson, Lanny Montgomery, Walter Prescott, James Gingrey, Dick Ulmer, Dick Sheridan and Leroy Manders. Bruce Campbell, Jerry Sailors, Ned Baynham, Dick Day, Jack Fallow, Glen Pentecost, Buck Thompson, Buddy Reddic and Charlie Williams. Don Montgomery, Bill Self, Bill Woodward, Jimmy Andrews, Ronnie Bolton, Dan Edwins, Richard Payne, Warren Griffin and Mike Zier. Dick Brown, Gerry Ferguson, Walton Cooper, James Mumford, Bill Alexander, Ben Ross, Art Bryan, David Rucker and Dickey Day. Not pictured : Jerry Priestley, John Douglas and Charles Boyd. Team Managers Thomas Boland, John J. Boyd Jr., Steven T. Traylor, Nolan L. Wiggins and Larry Hammond"
}