{
    "p1": "The North Augusta Boys of Summer - from Fox Warlick",
    "p2": "Think back to the place of your beginnings. Remember now where it all began for you. Close your eyes. Shut them tight. Do you remember your encounter with the rain outside when you were scheduled to play a baseball game? The frustration and anger welled up inside you like an ever heating volcano. Do you remember your backyard where you hit rocks or tennis balls with a broken bat nailed at the crack? Remember the house you lived in and the place where you kept your glove. Envision the ball rolling down the shingled roof where you had thrown it, awaiting its descent into your weathered glove as you practiced making the big catch. Can you close your eyes and make your way from first base to second to third and to home at old Mealing Field or Lions Field? Do you remember the faces of those teammates, the ones who loved you first in life? How quickly the memories return to us. The playing fields were dirt, gravel, and grass—but mostly dirt. The old fields behind Hammond Hills, Our Lady of Peace, Summerfield, NA Elementary, and Paul Knox were just like the ones that bore the names Lions and Mealing—mostly dirt.",
    "p3": "They possessed only three common ingredients in their seductive attraction: Dense woods around them where blackberries grew wild and balls disappeared; Water fountains with water so hot you’d just wait until you got home to get a drink;  Strange creatures that would crawl down the road to play, creatures with names out of a Stephen King novel like “Rabbit,” “Fuzzy,” “Reno,” “Fox,” “Peanut,” “Taz,” “Bo,” “Chief,” “Beebee,” “Knocker,” “Rosa,” “Meatwagon,” and “Moab.” These creatures would be umpired or coached by other strange creatures named “Cally,” “Grinny,” “Yogi,” “One Eared Robbie,” and “Bulldog.”",
    "p4": "The fences are gone now. The dugouts have been pushed to the ground, not even a burning ember left to remind us of what used to be. Gone. Everything, everyone—is gone. The tin scoreboards where numbers painted on slender metallic strips used to be manually hung to form a wild language with a 5 being hung upside down when you ran out of 2s and a 2 being place backwards when you ran out of 5s—all gone. The light poles no longer stand at attention in the hot South Carolina summer sun. All the achievements, all the honors, all the battles, they happened out there; but nobody’s there now. The old fields of summer no longer welcome us. They are gone and most of the dirt has been paved over. Are they gone or still here, buried somewhere between the recesses of heart and mind and soul? They are all still here. Not to be seen but to be sensed. Not to be mourned but to be celebrated. Celebrated for what they achieved against the odds and for what they placed in us. They are still here and we can feel the presence.",
    "p5": "They are here in all of us because we are here, a composite of all that we are, of all that we hope to be. So as we stand in the place of our beginnings wondering…remembering…wondering…remembering….. Have we kept faith with the hope that the place and people of our beginnings had for us? Have we placed in our own children and grandchildren the same deposit of love and hope, determination and vision, the thirst for excellence our beginnings placed in us? I hope so. I don’t know how much of our beginnings we can really remember. Those things we can remember, however, are significant. Returning home in person or in memory is spiritually valuable for all of us. There is a debt to be paid to those who knew us and loved us even before we knew ourselves. One thing is for certain: The same God who was with us on the dusty fields of North Augusta still walks with us on the paved streets of urban America. The same God who sustained us in the place of our beginnings is yet in charge of the place of our ending. We march toward a place we know not. Whatever heaven is like, the Scriptural images are unfamiliar to me. I am not well acquainted with pearly gates and streets of gold. I’ve never lived in a mansion here on earth. Saint Peter I know not, nor can I imagine what God looks like. It could be a strange walk in unfamiliar territory. I’ll probably be lost for a good while, even if I’m lucky enough to gain admission.",
    "p6": "But just maybe I can imagine that there will be some lights shining over beyond the miles of heavenly mansions. I will approach that back corner of Heaven with timidly and fear, for a Field of Dreams populated with the game’s luminaries it will not be. No pristine, grass covered and well lined field is this. And it certainly is not set against an Iowa cornfield replete with Kevin Cosner and James Earl Jones in the stands. To the contrary, dirt and gravel are everywhere. Chicken wire from Jordan’s Hardware is strung between real wooden posts to create fences. Second-hand lights from Fort Gordon adorn the tops of old telephone poles. Harold Dyer hangs by one arm at the top of a pole, hammering a nail. A little black cocker spaniel runs around down below. The stands are filling up with Mamas and Papas and the strange creatures with the funny sounding names are warming up. WT Wiggins is ready to throw out the first pitch. Jack Phillips has his camera ready to film and Paul Abernathy, without a wheelchair, stands feeling his scissors in his pockets, ready to put into his scrapbook the next day’s Heaven’s Gazette article about how I wound up in heaven inside of the other place. Stillwell loans me his big black bat and Tom Collins dusts off home plate and yells, “Batter up. Let’s play ball.” Irwin Pruitt lets out a howl that sounds like a big train rolling down the tracks by the Savannah River. The night suddenly comes alive with chatter.",
    "p7": "This I understand. This is as much home as any mansion could be. My soul has been anchored in a part of the ultimate tomorrow where the pieces of the puzzle always seem to fit. This moment, this time is not mine alone. It belongs to all who have helped create it. It is truly the place where the breath of my life blows anew and energizes my living of my days.",
    "p8": "The voice of God always speaks in familiar tones through the commonplace roads of our existence. The North Augusta summers are in our lives as more than just dancing silhouettes of memory. They are a backdrop to all that we do and all that we are. Like the gentle movement of our Mama’s curtains in the kitchen window, they evoke the sheer delight of a fresh breeze from the hands of God."
}