{
    "p1": "At the end of every summer, baseball All-Star teams are selected to play in the area to determine the best community team.  The summer of 1967 began this way and a group of ballplayers from North Augusta were entered in the Jaycee baseball tournament.  From August 7 through August 12 the North Augusta boys defeated teams from Augusta, Columbia County, Richmond County and Waynesboro to represent the State. The team then defeated the Virginia champs in two straight games to advance to the Dixie Boys World Series held in Jackson, Mississippi August 14-18.",
    "p2": "Mickey Mantle was on the front of the program and the south’s State Champions from Georgia, Tennessee, Florida, Mississippi, Alabama and Louisiana joined North Augusta and the host team from Jackson to determine the World Series Champs.  After a first round win over Louisiana, North Augusta earned an 8-3 win over pre-tourney favorite Jackson, Mississippi. Starting pitcher Walter Kraus was lifted and replaced by Butch Brown with NA down 2-0 in the second inning. Sandy Franklin’s home run in the third tied the score and Brown’s superb relief stint netted only one run and two hits for the opposition the rest of the game. In the third, Brown’s double and Terry Jones solo homer put the locals up for good.  North Augusta scored runs in every inning after getting blanked in the bottom of the first.",
    "p3": "North Augusta’s win earned them a shot at the unbeaten squad from Highland Park, Tennessee in the winner’s bracket final. A convincing 11-2 win gave the team a much needed rest as the balance of the tournament was played out to determine the finals opponent and a chance at history.",
    "p4": "Tennessee earned another shot at the title by winning the loser’s bracket to face North Augusta in the finals.  The double elimination tournament saw Tennessee earn an 8-6 win and force the deciding game. Sandy Franklin was given the ball but the high scoring affair was tied 5-5 after two innings.  Brown was brought in for relief and Franklin was sent to short where he would go 4-4 at the plate. Tied at 6 after 4 ½, North Augusta pounded the ball for 4 runs led by a Bruce Walters home run.  Brown shut out Tennessee the rest of the way to earn the win and the National Dixie Boys Championship to bring back to North Augusta. The buses were greeted by a throng of fans to bring to a close the championship run of another fine group of young men from our community.",
    "p5": "Team members included Robert Rogers, Al Duval, Mickey Derrick, Tommy Owings, Glynn Richey, Bernard Enevoldsen, George Whatley, Keith Ford, Sandy Franklin, Terry Jones, Jimmy Bush, Butch Brown, Dyke Dolly, Bruce Walters, Walter Krause, Jimmy Simiril, Phil Still and coaches Ray Walters, Bill Brown and Manager Milton Richey"
}