{
    "p1": "North Augusta has produced many fine golfers over the years, but few high school teams could claim as much talent at the same time as the 1973 Yellow Jacket squad. The previous year saw NA finish 6th in the state event and they set their goals higher for 1973.",
    "p2": "Team members Tommy Arnold, John Gibbs, Bill Gibbs, Stan Godwin, John Gustafson, Ronnie Jones, Pat Lynn, Conrad Rhodes and Dusty Rhodes comprised the Hubert Morris led team to their first state golf title.",
    "p3": "Playing home matches at North Augusta Country Club, the Yellow Jackets regularly defeated any team they faced, entering the Region Championship with only two losses in 21 matches. Their main rival was Aiken High and the Hornets held off the Jackets to claim the Region Championship and set up the State Championship held the next week at Furman University.",
    "p4": "Conrad Rhodes, John and Bill Gibbs, Pat Lynn and Ronnie Jones earned the right to represent North Augusta in the 54 hole tournament to decide the State Champion and battled 13 teams at the 6,134 yard Par 72 Furman University golf course, 36 holes on Thursday and 18 holes on Friday. The first 18 holes had North Augusta trailing Aiken by 6 strokes. Led by sophomore Pat Lynn's 77 in the morning and 75 in the afternoon, North Augusta surged back to a 4 stroke lead after 36 holes. Sophomore Bill Gibbs shot a NA tournament best 74 in the second round and Conrad Rhodes added a 78 to set up the final 18 holes of stroke play for Friday.",
    "p5": "By posting 4 scores in the 70's on Friday with John Gibbs at 74, Bill Gibbs 77, Pay Lyn and Conrad Rhodes at 78 and Ronnie Jones with 81, the Yellow Jackets won the match and the State Championship by 8 shots. Coach Morris added, \"All I had to do was show up at the meet and check the scores.\" Hillcrest finished a distant 3rd, twenty shots behind the champion Yellow Jackets.",
    "p6": "Pat Lynn finished 4th at 230, three strokes behind the medalist winner with Bill Gibbs an additional stroke back at 231. John Gibbs 234, Conrad Rhodes 239 and Ronnie Jones at 246 rounded out the scoring.",
    "p7": "Three golfers went on to play in college. John Gibbs played at Georgia, Pat Lynn at Georgia Southern and Conrad Rhodes at Augusta College. This first golf State Championship earned these players a place in North Augusta sports history and many of the players still remain in the area today."
}