{
    "p1": "North Augusta began the 1989 football season with one goal - winning the state championship. With most of the defense returning, the Jackets had a few key spots on offense to fill, notably at quarterback and running back. Two key offensive weapons were future NFL player Matt Campbell at tight end and a speedy receiver name Tywaun Tillman. During a scrimmage against Columbia High, Tillman’s season came to an end when he severely broke his leg.",
    "p2": "Having finished the previous year as the state runner-up, North Augusta was a favorite to play for, and hopefully win, the state championship, ending a 28 year drought for the Jackets. By the time North Augusta reached region play, the goal looked out of reach.",
    "p3": "Opening with the Strom Thurmond Rebels, NA lost a nail biter 13-12 when running back Lorenzo Nealious was run down after a long pass play as time expired. Next, North Augusta lost to longtime rival, and eventual Class AAA Runner-up Aiken 28-14 and a one-point loss to South Aiken. Week 4 opponent was the mighty Summerville Green Wave of John McCissick. After a hard fought battle, North Augusta was still winless, falling 17-14. Weeks 5 and 6 would see losses against region powerhouses Greenwood and Irmo. The season would start to come together in Irmo. Leading for most of the game, North Augusta lost to Irmo during a controversial double overtime affair. After the game, Campbell was asked by the media what the goal for the rest of the year was since the team was now 0-6. Campbell’s response was, “We’re going to win the state championship”. The rest of the state laughed.",
    "p4": "NA finally broke into the win column by dominating region rivals Airport and Lexington, and followed up with a 14-7 victory over Orangeburg-Wilkinson. Win number four was against Brookland-Cayce during Homecoming where Chris MacInnis set the state field goal record when he nailed a 60 yarder. He would hold the record for about ten minutes, as a kicker in Columbia made a 61 yard attempt. North Augusta finished the regular season on the road against Midland Valley. Despite leading 21-0 at halftime, North Augusta lost as time expired 27-21 to finish the regular season with a 4-7 record. The Midland Valley collapse would be a rallying cry during the playoffs.",
    "p5": "Opening at Laurens, North Augusta held off a late rally winning 18-15. The highlight of the game was the Laurens kicker attempting a game tying field goal that hit the crossbar, bounced straight up and fell unsuccessfully in the end zone. The second round found North Augusta defeating Airport 20-10. NA traveled to Union to win the Upper State Championship and a return to Williams-Brice Stadium in Columbia. After a disastrous first quarter which saw Union ahead 21-0, it looked like the dream was over. Offensive Coordinator Al Lown rallied the players with one statement: Remember Midland Valley. By halftime, Union was up 21-15. With three minutes remaining, the Jackets had 90 yards to go to win. Now known as “The Drive”, NA marched down the field to setup first and goal. After three incomplete passes, quarterback Richard Davis found Campbell in the corner of the end zone. After the kick, the Jackets were up 22-21. Union drove and attempted a long field goal, which was too short and wide left. In poor conditions, which included freezing rain, North Augusta defeated the Lower Richland Diamonds 14-0 to capture the Class AAAA Division II State Championship and give North Augusta a winning record for the season at 8-7. It was also Coach Utsey’s 100 th win as a coach."
}