{
    "p1": "The 1991 school year started out with a group of girls trying out for their cheerleading squad at North Augusta High School. The squad learned cheers and chants to root the Yellow Jackets on to victory in football and basketball games and pep rallies. Many practices, long bus rides and a school year long season is a physical challenge in what amounts to one of the longest season sports anyone can participate in. Coach Dee Dee Howard reminded the squad that school spirit, not competition, is what came first.",
    "p2": "The squad ran a summer camp for kindergarten thru middle school girls to raise money for new uniforms. They also attended a UCA summer camp to develop their cheering skills. The season was filled with football and basketball games for both boys and girls. But the squad of 15 girls and one mascot developed a 2 1/2 minute routine that combined a cheer, a chant and a dance to compete at the state level. On December 15, 1991 the state competition was held where the squad represented the Upper State teams in the competition and competed against Socastee High School, the lower state champs. After all the ballots were counted, North Augusta came out on top to win their first, and only, state cheerleading championship.",
    "p3": "Representing South Carolina in the national competition was the result of their title. The squad traveled to Orlando, FL and the Universal Cheerleader's Association competition, a nationally televised event. They competed against many other high school teams, but also against many \"competition\" teams that never cheered for a team or their school, only entering competitive events. Their national finish of 35th out of 89 entries was a great accomplishment. It took dedication, commitment, sacrifice and plain hard work. The event was not the culmination of their year but a stepping stone to represent their school and student body at the upcoming basketball season. The team is proud to represent the many girls and boys who have got their talent as cheerleaders for North Augusta High School.",
    "p4": "Team members are: Erica Thomas, Cecilie Broome, Amie Pitts Thomas, Anne Whitlock Moody, Ashlee May Cook, Holly Seay Humphries, Jeanette Pruett McCoy, Jenny Miley Heichelbech, Jill Magness Manly, Lynne Motes Toole, Nikki Cooper Hendry, Tiffany Blevins Mansfield, Trina Nichols Offing, Jennifer Zier Balon, Beth Ann Burkhalter Young."
}