{
    "p1": "  Al was born in Greenwood, SC to Buren and Mary Frances Lown on April 24, 1956. The family moved to North Augusta in 1958 when Al’s father became employed in the Aiken County School system. An all-around athlete his entire life, he lettered at North Augusta High School in football, basketball and baseball. His football honors included All Big 9 quarterback his junior and senior years of 1972 and 1973. He was the starting shortstop on the Aiken Post 71 American Legion State champions of 1973 which became the focus of his collegiate athletic career. An excellent golfer, he also won the 1974 Iron Man golf tournament held at Seven Lakes Golf Course against the finest junior golfers in the area.",
    "p2": "Attending Augusta College, the fleet footed shortstop set an Augusta College record for stolen bases in a season and ranked 2 nd nationally for Division II schools. Upon graduation, he sold commercial real estate and was a volunteer coach at Paul Knox Middle School. In 1981 he accepted a job at Silver Bluff as a teacher and assistant football coach. In 1985 he came as offensive coordinator for the Yellow Jackets being instrumental in the 1988 State Runner-up finish and the 1989 State Champion football team that has also been enshrined in the Hall of Fame.",
    "p3": "Al would coach a number of sports including baseball, golf, girls and boys basketball and girls track, however he is most noted for his success on the gridiron sidelines.",
    "p4": "Hired as Head Coach in 1993 at nearby Silver Bluff High School, the lifelong North Augusta resident had a tremendous career with the Bulldogs. His team’s accomplishments included an overall record of 212 wins against 76 loses, 14 Region Championships and participated in 8 Lower State title games. Those teams were able to accomplish 4 Lower State Championships and 2 State Championships for the Silver Bluff squads. He was selected as South Carolina Football Coach of the Year in 2001 and AA Athletic Director of the Year in 2014. He retired in 2016 after 35 years of service.",
    "p5": "Al has coached many football players that have succeeded athletically totaling 40 to play at the collegiate level and five that went on to play in the NFL. This number is still growing since his retirement in 2016 as players continue to excel at the next levels of play. He was also a mentor to countless students and athletes form his career that may go unnoticed ion the sports pages, but remembered forever by the students themselves.",
    "p6": "Al has one sister, Popie Lown Roberts and is married to another former educator Mary. They have two children, Ben and Jessica. Al Lown’s name will forever be remembered for his accomplishments at Silver Bluff High School, but many will also remember him as a North Augusta athlete, coach and member of our community for his entire life."
}