{
    "p1": "Baseball was a way of life for Allen Simmons, Growing up on 411 West Avenue in North Augusta. Playing in Little League, Allen had a strong arm at a young age. When the Coach asked him if he ever pitched, he replied, “No, but I would like to try!” that innocent start began an all- star pitching career in Pony League, High School and college that proved to be one of the best to ever come from North Augusta.",
    "p2": "Allen led his Dixie Little League World Series team as a pitcher in 1959 in Lakeland, Florida to a second place finish.  He held the World Series record for strikeouts in a 6 inning game on a Monday (16 K’s out of 18 batters), added another 11 on Wednesday to hold the most strikeouts per series record (27 K’s out of 36 batters) for many years.  “I had a God-given gift, to be able to throw a baseball through a brick wall and the accuracy to nearly name the brick.” Moving on to Pony League, “Big Chief” twice struck out 20 players in 21 at bats.  He pitched a perfect game in the Aiken Regional game with 15 K’s in 7 innings of play.  His teams also won back-to-back State Championships in the Palmetto Majors division, with Simmons pitching a no- hitter with 17 strikeouts in the 1964 tournament.  He gave up only 1 hit in 14 innings on the mound.",
    "p3": "High school baseball continued to develop this rifle armed pitcher as a three year starter, leading his team to the brink of a State Championship his senior season. When not pitching, Allen played right field for the team.",
    "p4": "Allen also played football for the Jackets, a two way starter as an offensive and defensive lineman.  He won the STAR Player of the Week Award Twice, Against Richmond Academy and LBC.  He was recognized as the NA Lions Club Outstanding Athlete of the Year in 1964. Baseball continued for Allen by signing a scholarship to Georgia Southern College.  A 4 year letterman with a combined record of 22-9, his first collegiate game was against South Carolina, a game he won 6-3.  His career included two NAIA College World Series with a 5 th  place finish in 1967 and National Runner-Up in 1968 to William Jewell, losing the championship in 13 innings.  Due to some arm issues his senior season professional baseball was not a possibility. Simmons stayed at GSU to earn a Master Degree in Teaching and serve as a Graduate Assistant for the baseball team.  After two years he accepted the job of Administrative Assistant to the Dean of Students.  He was later appointed Director of Financial Aid and Placement and stayed for four years.  He also spent 10 weeks a year in the Governor’s Honor Program for the State of Georgia.",
    "p5": "Upon leaving GSU, Allen worked for Allstate Insurance by returning home to North Augusta.  He has been recognized 23 times with the Honor Ring Award, 10 time recognition of National Conference and 7 time Chairman’s Conference winner.  Allen remains in North Augusta and is a generous supporter of youth athletics."
}