{
    "p1": "Antonio Grant may be the most accomplished basketball player in the history of North Augusta High School. The former Yellow Jacket was the 4A Player of the Year, averaging 24 points, 18 rebounds, 4 assists, 2 steals and 2 blocks during his senior season. It also included All-American honors for the 6’4” graduate.",
    "p2": "Following high school, Antonio played for New Hampton Prep where they won the New England Prep Championship, averaging 22 points and 12 rebounds and being selected a Coca Cola All-American. He attended the University of South Carolina 1996-2001 competing in the SEC where his teams were the 1997 SEC Champions, 2 time NCAA tournament invitees and once an NIT participant. He was selected to the All-SEC Freshman Team and awarded the Team MVP during his Senior Year. His most memorable week of play included a tip-in to beat Florida at the buzzer and a 3 pointer, known as “The Shot”, to down #18 Cincinnati on national television for his #13 Gamecocks. Hampered by injuries during most of his college days, many players would have called it a career. But Antonio had his sights set on higher goals.",
    "p3": "Grant played in the NBDL for the North Charleston Low Gators in 2001-2002 earning the regular season championship. He continued his career in Europe and the Middle East by playing 14 seasons in places such as Russia, Croatia, Ukraine, Lithuania, Lebanon, China, Taiwan, Mexico and Jordan. In Lithuania in 2004 he was the scoring Champ of League averaging 19 points and 8 rebounds while participating in the LKL All-Star Game and being selected the Baltic League Forward of the Year. In 2008 he participated in the Dallas Mavericks Summer Camp before returning to Croatia to play.",
    "p4": "While playing in France, he met his wife Edese and has three children, Eliora, Kiani and Ela who were all born in France. Now retired from playing, Antonio feels blessed to have had the chance to travel and use his talent to explore and see various cultures around the world. He runs basketball camps in the area and gives back to the game that has given him so much."
}