{
    "p1": "Beth’s high school career started at Hanahan High School, in Charleston, SC as a freshman guard on the basketball team, averaging 14 ppg and a 1 st team All Conference selection. She also played tennis and started on the 1974 State Champion volleyball team. A family move to North Augusta brought her and her athletic prowess to NAHS where she continued an amazing display of talent.",
    "p2": "Beth’s high school career includes a two-time Aiken County scoring title, All County selections, All Conference selections, and MVP’s in basketball and tennis. As a sophomore, she set the single game scoring record at 34 points vs Dreher, then broke the record as a junior with 39 points against Blackville-Hilda. She totaled 1215 points in a high school career that ended in her junior year and in a period before three point shots while using the larger men’s basketball. She was selected All State as a junior averaging 23.4 ppg.",
    "p3": "In 1978, she forgoes her senior year to accept a full scholarship to Augusta College and continued an amazing domination on the basketball court. A four year starter, 1978-81, her career 20.4 ppg average totaled 1836 career points, a record that stood for 16 years, again before three point shooting was introduced to college basketball.",
    "p4": "Beth was an All State/Conference selection all four years at AC. She still holds the following records at Augusta College, now known as Augusta State: Career Field Goals at 783, Field Goal Attempts at 1591 (49% career shooting from the field), Season Free Throws at 88.3% and Career Free Throws at 84.9%.",
    "p5": "After college, Beth became a teacher and has taught for 31 years and counting. She has coached at NAHS in varsity softball, tennis and JV basketball, Paul Knox Middle basketball, and Jackson Middle volleyball and basketball. She has been a volunteer coach in the Recreation Leagues for over 10 years for both boys and girls teams. She was instrumental in the development of her three children Trey, Sarah and Kay who all went on to play at NAHS and is a member of First Baptist Church of North Augusta."
}