{
    "p1": "At the conclusion of the 1986 football season, the North Augusta Yellow Jacket football team had won 5 games in the past three years. North Augusta chose Charleston native Bill Utsey as the next head football coach and athletic director.",
    "p2": "A 1970 graduate of The Citadel, where he was a member of the football team, Utsey had a great deal of success as a head coach. He coached 10 years at JL Mann High School and amassed a record of 62-45-1, including an appearance in the Class AAA State Championship game in 1984 and the honor of serving as an assistant coach in the North-South game. Utsey had one goal in mind when he accepted the job: return North Augusta to the dominance it once had from the 1950’s to 1970’s. Utsey saw first-hand this dominance when he was the head coach at Porter-Gaud High School in 1973, when he lost to North Augusta 39-0 at Lion’s Field. His overall record coming to North Augusta was 78-58-2.",
    "p3": "In his first season, Utsey led the team to a 5-6 record, losing in the first round of the playoffs to Wade Hampton of Greenville. For equaling the win total from the previous three seasons, Utsey was named Region 3-AAAA Coach of the Year. In 1988, the state knew that North Augusta had returned. North Augusta won the Region Championship, its first since 1977, and earned a spot in the Class AAAA Division II State Championship, their first appearance since 1961. North Augusta lost to Hartsville 21-12 to finish the year with an 11-4 record.",
    "p4": "In 1989, Utsey gained legendary status in North Augusta by leading the team to the Class AAAA Division II State Championship. After starting the season 0-6, the Jackets won four of their next five games to enter the playoffs with a 4-7 record. Having to travel throughout the playoffs, North Augusta fought its way to Columbia where the Jackets defeated Lower Richland 14-0.",
    "p5": "In 1994, Utsey stepped down as head football coach to pursue a job in administration. While the head coach, Utsey led the Jackets to the playoffs all seven years, compiled a record of 56-36, the fourth most wins of any coach at North Augusta, and was named an assistant coach for the Shrine Bowl in 1992. He was also named Region 3-AAAA Coach of the Year twice, 1987 and 1988, The Augusta Chronicle Coach of the Year in 1989, and the Aiken Standard Coach of the Year in 1988. His overall coaching record was 134-103-2.",
    "p6": "Once Utsey left North Augusta, he served as the Principal at Wade Hampton High School in Greenville for four years and has been the Athletic Director for the Greenville County School District for fourteen years, the position that he holds currently. In 2008, Utsey was named to the South Carolina Lacrosse Hall of Fame due to his promotion of the sport in South Carolina.",
    "p7": "Utsey’s motto while at North Augusta was “Mission: North Augusta Tradition”. It is safe to say that the mission has been accomplished."
}