{
    "p1": "Charles Anthony Williams grew up one of fourteen children in a house that was located on the present day River Golf Club. There may be no other person who combined athletic talent and a colorful personality than Charlie. Growing up in North Augusta in the 1950’s meant sports were a part of your life and Charlie was a great example. At North Augusta High, he played four sports including football, basketball, baseball and track.",
    "p2": "An exceptional baseball player as a catcher, he often rode a horse to Lions Field to practice, tied it up on the fence post and rode back home when he was done. His father passed away early in his life and Charlie once hit a home run at Lions Field that landed in the cemetery next door. The ball stopped on his father’s grave, he felt as a personal tribute to the man they called “Blackhorse”.",
    "p3": "Voted “Most Ambitious” as a sophomore, he was a fleet footed halfback of the Yellow Jacket football team that went, 11-0, 11-0, 7-0-3 and 9-1-1 giving him a 38-1-4 record as a player. He played point guard for Coach Buist on the basketball team and participated in track &amp; field for Coach Gault in the mile, 440, discus, shot put and javelin. On graduation night at North Augusta High School in the hall after the ceremony, he signed a Grant-in-Aid scholarship to the University of South Carolina to play football.",
    "p4": "At Carolina, he played football and baseball, plus one year of basketball as a freshman. “We had a guy with size 21 shoes, and I couldn’t jump as high as his shoes so that ended my college basketball career”. Charlie earned the name “Steelball” as a Gamecock for his knack at breaking football helmets, 17 in all. Most were the protective straps inside the helmet but two of them were the helmets themselves.",
    "p5": "Charlie excelled at baseball on the collegiate level, again as a catcher, being among the leading hitters in the ACC during his career. He was also a good student and planned on attending Dental School upon graduation at the University of Virginia until a coach intervened and he was accepted at the University of Tennessee. Upon completion of dental school, he entered the United States Air Force and remained there until 1969 when he returned to North Augusta to open his practice. He remains in business today after 44 years on the job. Charlie has 5 children and 10 grandchildren, living with his wife Karen on a small farm in Beech Island, SC.",
    "p6": "Anybody that knows Charlie has a favorite story to tell, and all are told with a smile on their face. He will long be remembered as a great athlete, story teller and personality of our great community."
}