{
    "p1": "One of three boys that moved to North Augusta in the early 1960's, Charlie Waters was an outstanding athlete in any sport he chose. For years he had the home run record for Little League baseball and established himself as a leader on the athletic field. His football accomplishments led him to a highly recruited experience that landed him at Clemson University playing with legendary coach Frank Howard as a quarterback and split end. An All ACC selection his senior year, his three letters earned him a third round draft choice of the Dallas Cowboys.",
    "p2": "As a player, Charlie Waters was a mainstay for the Cowboys &quot;Doomsday Defense&quot; during the 1970-82 seasons. Those years were recognized as the glory years of the Dallas franchise and the inception of the claim of America's Team. He never experienced a losing season, played in 5 Super Bowls, won two World Championships and has been nominated for the Pro Football Hall of Fame.",
    "p3": "Charlie was selected to the Pro Bowl 3 times and was honored 3 times with All-Pro selections. He is second in Dallas history in total career interceptions with 50 and he holds the NFL record for most thefts in playoff games (9), including 3 in one game (also a record). A fan favorite, they twice voted him as their Favorite Cowboy and most recently to the Dallas Morning News All-Time Cowboys Team.",
    "p4": "Other honors include NFL Rookie Team, Sports Illustrated Unsung Hero Award, Summerall/Madden All-Cowboys Team, Dallas Cowboys Silver Anniversary Team, South Carolina and Clemson University Hall of Fame and the elite group of 300 All-Time Greatest Players as recognized by Total Football, the Encyclopedia of the NFL.",
    "p5": "After retirement, Charlie worked as a NFL analyst for CBS Sports before re-entering the NFL as a coach. Charlie coached 8 successful seasons in the NFL and collegiate level.",
    "p6": "In 1996, Charlie and his family returned to Dallas so that he could return to the private business sector and is involved with many community and charitable activities including the Fellowship of Christian Athletes, the I'm Third Foundation of Kanakuk Kamps, the Boles Home for Children, the American Diabetes Association and the Cody Waters Memorial Fund. He presently is employed by Energy Transfer Group and works with his longtime NFL teammate Cliff Harris."
}