{
    "p1": "Charles “Possum” Overstreet is considered by many as one of the finest natural athletes they have ever seen.  A guard and defensive lineman on the legendary teams of the late 50’s at North Augusta High School, he was often singled out as the leading cause of another Yellow Jacket victory.  As quoted in the Augusta Chronicle, he was “accused of spending more time in the Richmond backfield than some ARC Backs”.",
    "p2": "During Overstreet’s high school career, North Augusta never lost a football game.  He was identified as an all-state player throughout his career and earned that title in 1957.  He was selected to play in the Shrine Bowl and named Top Lineman in the game that netted his South Carolina team a 12 -6 victory.  Over 20,000 people attended the game and earned Overstreet the honor he said was “his greatest”.  He also played in the North South game, again leading his team to a 19-0 victory as a defensive lineman, stifling the favored North team running backs and also blocking a punt.",
    "p3": "Charles stood 5’10” and weighed about 170 pounds. His success is attributed to very strong and quick legs. Despite his size, he could easily dunk a basketball by simply jumping up from beneath the basket. Offensive lineman were no match for his speed, often times enabling him to tackle a halfback as soon as he received the ball. His dominance over All-State player and future Auburn football coach Pat Dye earned him STAR player of the Week honors against archrival Richmond Academy. Not only a stand out football player, Overstreet was a three time State Champion in shotput while participating for the NAHS track and field team.",
    "p4": "His play earned him the interest of many college football programs including the Citadel, North Carolina, Clemson and the University of South Carolina, where he eventually accepted an offer to play for the Gamecocks.  He joined a group of North Augusta athletes in Columbia that had as many as 5 former Yellow Jackets on the field at the same time. After his college career ended, Overstreet moved to Alabama where he became a successful poultry farmer and continued his love of sports as a football coach. Charles Overstreet passed away a few years ago, but left a legacy of football skills that enshrines his name as one of the very best to ever play for the North Augusta High School Yellow Jackets."
}