{
    "p1": "The year was 1989 and North Augusta High School football would have a year like no other. If you know anything about North Augusta, it’s not hard to call to mind the 1989 State Championship, in which North Augusta beat Lower Richland for the title of State Champion. Part of this team was Chris MacInnis, who played as the team’s running back and kicker.",
    "p2": "McGinnis began to play football at the age of twelve, and received many sports honors while in North Augusta. These include being a North Augusta High School Football 1989 State Champion, a selected player for the Shrine Bowl, as well as being a part of the North-South All Star Game. His 62 yard field goal was s state record for a brief amount of time. His career certainly didn’t stop there. Going on to graduate in 1990 and attend the United States Air Force Academy, he played as both the place kicker and punter. It was at the Air Force Academy that he received many of the other honors. These include First Team UPI All-American (coaches poll), as well as Second Team AP All-American (sports writer poll). He was the 1994 Outstanding Athlete at the United States Air Force Academy. MacInnis also led the nation in net punting average in 1993, with an average of forty-seven yards.",
    "p3": "From the United States Air Force Academy, MacInnis began his professional football career. In 1994, he was drafted by the Cleveland Browns. However, he did have a military commitment to fulfill. This included serving two years in the Air Force, as well as becoming a calculus teacher at the Academy. He went on to serve as a civil engineer at the Patrick Air Force Base in Florida. Once this position concluded, he was able to sign with the Baltimore Ravens and the New York Jets.",
    "p4": "MacInnis now lives in Atlanta, Georgia with his wife, Maria Turner. They have two kids, Turner (16) and Claire (15). Both play travel soccer, and often all over the country for their sport. MacInnis now works in healthcare as a chief revenue officer for a home health and hospice company known as “Elara Caring”. When asked about his time at North Augusta, MacInnis stated that his favorite memories included spending time with friends, as well as the help he received from Sarah Anderson, whom he states he wouldn’t have made it to the Air Force Academy without. Furthermore, MacInnis stated that he is humbled to receive this induction and is glad to have been a part of the North Augusta community."
}