{
    "p1": "Darby Elizabeth Sligh was born on May 9 th , 1983. She quickly got a head start on her athletic career when she played for the soccer team starting in the 7th grade. Even though she loved soccer her passion would also turn to another sport. By the time high school came around, Darby found a love of golf. Unfortunately, there was no girls' golf team at North Augusta High. She did not let that deter her and, through perseverance, eventually found herself on the boys' golf roster. Her love of sports did not stop there. She went on to also play basketball and softball through her high school years, however, her time was mostly dedicated to soccer and golf. During her soccer career, she received multiple awards including Soccer All- Region Player in 9th, 10th, and 11th grade, Top Region Freshman Scorer with a total of 21 goals her freshman year and Outstanding Offensive Player. She was also very successful golfer, as well. Throughout her golf career she received awards for both All-Region and All-State golfer. ",
    "p2": "Even though Darby was a star on the soccer field and the golf course, she was very involved in other after-school activities and still managed to maintain a very high GPA. Darby was inducted into National Honor Society, participated in Student Council, and was Co-Editor of the Sandspurs yearbook. To add to all that, she received the Who's Who award in 11th grade, the Beta Sigma Phi Annual Excellence Award her senior year for academics, athletics, and attitude, and was nominated into the 2001 graduating class Hall of Fame. ",
    "p3": "When Darby's high school career came to an end in 2001, she received a scholarship to play golf at the University of Alabama. With this scholarship, she became the first female at North Augusta High School to receive a golf scholarship. Darby went on to play golf at Alabama, majoring in marketing and graduating with a bachelor's in commerce and business administration and then went to graduate school at Illinois State University studying sports psychology. She then became the head coach at Newberry College and the head coach at Illinois State University and received 2008, 2009, 2010, and 2011 Missouri Valley Coach of the Year as well as team region, conference, and national awards.",
    "p4": "Darby now lives in Cary, North Carolina and is the assistant golf coach at NC State University and has received the 2020 WGCA Golf Pride Grips Assistant Coach of the Year as well as other team awards. She also is the founder of Low-Slung Moon Woodworks where she designs and welds different woodworks when she is not coaching."
}