{
    "p1": "A 1959 graduate of North Augusta High School, Dick Sheridan earned his Education degree at the University of South Carolina. He immediately began his stellar career at Eau Claire High School as assistant football and head basketball coach. His basketball team reached the AAAA Final Four in &#39;67 and finished state runner-up in &#39;69. Moving to Orangeburg HS, he won the 1971 State AAAA Football Championship going 13-0, following up a 10-1 season in 1970. He left Orangeburg for one season at Airport High to lead them to their first playoff appearance in school history with a 9-2 record.",
    "p2": "The college ranks came calling in 1973 when he accepted the assistant football position at Furman University and was promoted to Head Coach in 1978. He stayed at Furman through 1985, serving for 3 years as Athletic Director. He once turned down legendary basketball coach Roy Williams for a position at Furman. His 1978 squad won the Southern Conference Championship for the first time in school history. Coach Sheridan was also selected Southern Conference Coach of the Year in 1978, 1980 and 1982. His .744 winning percentage ranked 1st among active 1-AA coaches. Furman was ranked #1 in the nation in 1985, where they finished runner-up in the National Championship game.",
    "p3": "1986 brought a new opportunity when Sheridan was selected as Head Football Coach for North Carolina State University in Raleigh, NC. Leading the Wolfpack to six bowl games in seven years, he continued to gain recognition as ACC Coach of the Year, AFCA Region Coach of the Year and 1986 National Coach of the Year. He completed his tenure at NC State with a record of 121-52-5 ranking him 6th among active college coaches with a .694 winning percentage. He was selected to coach in the 1993 East-West College All Star Shrine Bowl and served on the American Football Coaches Association Board of Trustees from 1989 to 1993.",
    "p4": "Dick Sheridan has been a consistent winner throughout his coaching career. He is also a member of the Aiken County and SC Athletic Hall of Fame."
}