{
    "p1": "A powerful running back, Dick excelled for North Augusta during an unprecedented unbeaten streak culminating in the 1958 AA State Championship. His early years at North Augusta were spent as a lineman and nose guard on one of the stingiest defenses in all of high school football. Day was converted to fullback as a senior and remained the nose tackle on defense. Doing the bulk of running during a 6-0 defeat of archrival ARC, Day racked up 92 yards and the only touchdown to bring the streak to 37. A converted offensive guard for his senior year, his punishing running style continued a strong tradition and style of Cally Gault football. He was the leading scorer in the CSRA during his senior season. He was selected as the Outstanding Football Player of the CSRA by the Augusta Chapter of the US Army. He was also selected a National High School All American by the Wigwam Wisemen of America football committee.",
    "p2": "Dick played as a guard on the Shrine Bowl team in Charlotte, NC. The annual North-South game was led by Day on both offense and defense, with him scoring the only touchdown in a 6-0 victory. He was also selected Captain of this team by his teammates. After an outstanding football career at North Augusta, he signed a full football scholarship to the University of South Carolina.",
    "p3": "Dubbed \"Mr. Inside\" for his powerful running style, sports reports are full of stories where #35 broke tackles and bounced off players to gain yards. He was often the leading rusher for a tough USC Gamecock squad. Day was the leading scorer during his sophomore season and led the team in total rushing yards as a junior. He was the most productive fullback in the entire Atlantic Coast Conference. Day was the leading rusher again as a senior when he suffered a season ending knee injury during the 4th game of the year. He was Team Captain during the 1962 season.",
    "p4": "Dick Day retuned to North Augusta to deliver the address to the North Augusta Sports Banquet as a graduating senior from USC. He stressed an athlete&#39;s obligation to live a clean life and do what is right to serve as an example for others. \"A good argument for doing right is that some youngster will want to be just like you."
}