{
    "p1": "Ed Stillwell graduated from the University of South Carolina where he was a member of the football team. He went on to receive his Masters Degree from USC after he found his way to North Augusta. His arrival in 1945 was a fortuitous blessing to the community. He accepted a position as principal and coach where he would remain until his retirement in 1977.",
    "p2": "The previous football coach was a traveling salesman who did little but sit in the stands and let the boys coach themselves. Coach Stillwell began to teach the team fundamentals and conditioning and laid the groundwork for the dominant teams of the future for the Yellow Jackets. He also coached the boys basketball and baseball teams, leading them to the baseball State Championship in 1949 behind fellow inductees Don Metz and Earl Baynham. Ed Stillwell was instrumental in developing the community pride in the football program that continues until this day.",
    "p3": "During his career he aptly oversaw and molded the building and development of two new high schools, the first of which was built in the 1950&#39;s to accommodate the swelling population that accompanied the Savannah River Plant. In 1970, as the community began to grow, a new school to hold 1500 students was opened. He was chosen to lead a number of evaluation teams for the Southern Association of High Schools.",
    "p4": "One of his proudest achievements was establishing a young adult Sunday School at Grace Methodist Church, which he led for 50 years. The class is now named in his honor. As a member of the North Augusta Lions Club, he served as President and almost every other capacity from kitchen duty to ticket sales at football games. The Lions generously provided the playing field for North Augusta football and baseball teams until the early 1970&#39;s when the community built a football stadium without the benefit of any governmental financing. Mr. Stillwell was a quiet leader who did not seek public recognition. He preferred working in the background and providing a positive influence for youth. He led while instilling Christian principles during a period when North Augusta experienced tremendous growth and unpredictable behavior as segregated schools blended into integrated schools. Mr. Stillwell looked at problems as challenges and demanded and received the utmost respect as he guided North Augusta&#39;s teenagers."
}