{
    "p1": "When asked about her athletic prowess, Ellen Smith will quickly answer, “Absolutely none”! But a lifetime of service to the City of North Augusta with a dedication to parks and recreation, entitle Ellen to a place in the North Augusta Sports Hall of Fame.",
    "p2": "Born in Minnesota in 1918, Ellen received her college degree from Kansas State in 1940. There she met and married her husband, Ivan. They became a pair of self-proclaimed gypsies living in New Jersey, Wisconsin, Tennessee, Alabama, Illinois and Delaware before moving to North Augusta in 1951. She settled here for good and has made a lasting mark on our city. While Ivan was doing atomic things, Ellen became a nuclear dynamo in the community.",
    "p3": "The Smiths quickly found a home in the newly formed Fairview Presbyterian Church where she is still a very active member today. Much of what is currently happening in North Augusta had its beginnings from the work of Ellen Smith. She was a principal in the founding of SNAPS “Show North Augusta’s Prettiest Side” which emphasized litter clean up and city beautification. In May of 1971, she was elected to City Council. She served several terms thru 1989. She says “I was elected several times and thrown off twice.” She was also a fixture as a Pink Lady at University Hospital and volunteered at the Salvation Army.",
    "p4": "When the city lost its charitable lease on the local recreation complex was needed. In the old days, individual council members were in charge of various committees of city government. Ellen became chairman of the Recreation Committee. Throughout her many terms of office and even today, she maintains an overwhelming desire to increase the recreational and athletic facilities of the City of North Augusta. During her service, she dedicated herself to the building of Riverview Park, the Greeneway, Activities Center, and numerous other parks and beautification projects throughout the city. Largely in part of her efforts, the recreation department of the city went from just a handful of employees to a fully operational department. The recreation department now has football, baseball, basketball, soccer as well as many other activities. It also runs a number of tournaments including the Nike Peach Jam for men and Nike Nationals for women. The building of the Activities Center and the Greeneway were her pet projects that she was proud to assist in bringing them to fruition.",
    "p5": "Ellen’s devotion to creating parks, ball fields and athletic facilities in the City of North Augusta has enabled thousands of North Augusta’s young boys and girls to become athletes. These facilities have also allowed all North Augustans a place to exercise and recreate.",
    "p6": "Now, 88, the self-proclaimed non- athlete, celebrates milestone birthdays by running the rapids on the Colorado River or more recently on her 85 th birthday by skydiving, Word has it she has scheduled a trip on a space shuttle for her 90th."
}