{
    "p1": "Frank Staley moved to North Augusta in August, 1955 from Williston, SC when his father&#39;s job promotion brought him to the area.  He unwillingly came along, not happy to be leaving his home town.  He tried out for the Cally Gault led Yellow Jacket football squad and two weeks later became a starter on the team as a junior.  He would not lose another high school football game.",
    "p2": "A member of the undefeated 1956 team denied an opportunity to play for a state championship, they duplicated the feat in 1957.  Joining many of his fellow players from this golden age of North Augusta football in the NA Sports Hall of Fame, he has many highlights to remember, but none better than winning against the number one school in Georgia, Richmond Academy.",
    "p3": "As a high school player, he was recognized as the STAR Outstanding Player of the Year for 1956 (the only lineman ever to be recognized), co- captain of the All CSRA team, All-State team for South Carolina, Shrine Bowl participant playing both offense and defense and a player in the North-South All Star game in 1957. He was widely recognized as the area&#39;s best downfield blocker.",
    "p4": "Frank accepted a football scholarship at the University of South Carolina.  He was the starting tackle as a member of the freshman class of 1957, red-shirted in 1958 and awarded &quot;Outstanding Lineman for the Red Shirt team&quot;.  In 1959, he played in every game for USC and in 1960, moved to the starting position for the Gamecocks as a 6&#39;2&quot; 215 pound tackle wearing number 70.",
    "p5": "In 1961, he was one of five North Augusta graduates on the team, and it was not uncommon for all of them to be on the field together. With two games left in the 1961 season, Frank’s separated shoulder ended his playing career.  However, he was named to the ACC Honor Roll for &quot;outstanding academic achievement during athletic participation&quot;.  He remained at the university as a freshman line coach while earning his MBA degree in 1962.",
    "p6": "Frank is the proud father of four accomplished and talented children and 'Pops' to 12 grandchildren.  He has never grown tired of telling the stories of a winning team, great coaching, friendships and real community support of his time in North Augusta."
}