{
    "p1": "Fred Vinson is among the elite list of athletes to come out of North Augusta as a professional football player. At a young age it was apparent he was more than a step ahead of his competition. At the age of 10, he competed in the Utah Junior Olympics where his 40 yard dash time was a mere 0.02 seconds behind the nations best. It takes 0.1 seconds to blink an eye.",
    "p2": "At North Augusta High School, Fred was a standout football and track star. He recorded 99 tackles his Senior year to earn a football scholarship to Vanderbilt University.",
    "p3": "While playing for the Commodores, he made an impact as a freshman starting one game and registering 30 tackles. His outstanding play earned him a starting position for the 1996 season. The speedster garnered a career high 53 tackles, 39 of them solo, and followed up with a junior season of forty eight tackles, with 44 of them solo. His senior season was cut short by an injury that prevented him from playing much in his senior season.",
    "p4": "That did not prevent Fred from being drafted in the 2nd round, 47th overall, by the Green Bay Packers. He played as a nickelback and had one sack, two interceptions and 19 tackles for the historic franchise. He was acquired by the Seattle Seahawks for running back Ahman Green and a 5th round draft pick for the 2000 season. An off season ACL injury slowed his career but not before a stint with the Carolina Panthers and the Carolina Cobras of the Arena Football League.",
    "p5": "After his playing days, Fred took some of things he learned at Vanderbilt and taught himself how to build websites. Then that turned into learning how to bring online traffic to the websites that he built. That&#39;s when he started his own marketing agency which is now called Lead Automation Systems.",
    "p6": "Now he helps local business owners create marketing automation systems to generate leads online. His goal is to help as many business owners he can automate at least 80% of their marketing so that they can free up their time to service their customers."
}