{
    "p1": "Few people, if any, can claim a larger impact on the sports heritage of North Augusta without being an athlete than George Parks.  Parks Pharmacy was and is the largest independent retail pharmacy in North Augusta.  His innovations included drive-in window and home delivery.  The founder in 1961 of Parks Pharmacy, he organized a group of businessmen and community leaders known as The Stadium Club to plan and build a new N.A. Sr. High School stadium as a project of the Greater North Augusta Chamber of Commerce.  Elected unanimously as General Chairman of The Stadium Club, Parks also served on the Fund-Raising and Finance Committee.  Under his leadership, The Stadium Club raised over $200,000 within 5 months.  It was the largest community fund raising effort ever held in the city of North Augusta.  The North Augusta Sr. High School stadium was completed in 1977 through the generous donations of materials, technical expertise, time, and money of the citizens of North Augusta and the students of North Augusta schools designed and built without one penny of federal or state money.",
    "p2": "George Parks sponsored Dixie Youth and Pony League Baseball teams and was a member of North Augusta Yellow Jacket Club for decades.  He was a Peach Jam volunteer from its inception into his 80’s and faithfully attended and supported N.A. Sr. High athletic events.",
    "p3": "George Parks’ long career in community service includes President of the North Augusta Jaycees, President of North Augusta Chamber of Commerce in 1962, First President of North Augusta Exchange Club, Chairman United Fund Drive for North Augusta, leader in North Augusta downtown revitalization, Board of Directors of the local S.C. National Bank, Board of Directors for Salvation Army, USC Aiken Advisory Board, Board of Directors Augusta-North Augusta Retail Druggist Association, Board of Directors Connie Maxwell Children’s Home (Greenwood, SC) and Vice Chairman North Augusta Planning Commission.",
    "p4": "His community awards include the 1960-N.A. Jaycees’ Distinguished Service Award, 1961-N. A. Jaycees’ “Young Man of the Year”, 1965-N.A. Jaycees’ “Outstanding Boss of the Year”, 1977-N.A. Chamber of Commerce “Citizen of the Year”, A.H. Robins Co.  “Bowl of Hygeia” Award for outstanding community service by SC Board of Pharmacy, the prestigious 1982-Sertoma Club of North Augusta “Service to Mankind” Award and the CSRA Business Hall of Fame Laureate.",
    "p5": "George Parks will forever be remembered as a pillar in our community and has created a sports and service legacy with his dedication to North Augusta."
}