{
    "p1": "Born and raised in North Augusta, Gerry Saggus was an outstanding athlete in the 1960’s and 70’s.  Parents Hubert Earl and Barbara Saggus provided Gerry with an opportunity to play and excel on many athletic fields.",
    "p2": "A three sport athlete, his favorite sport was football.  The speedy running back played basketball and was an excellent baseball player roaming center field. In 1968, he was a member of the State Champion Boys of Summer All-Star team and participated in the Dixie Youth World Series in Birmingham, Alabama.",
    "p3": "Football is where Saggus shined.  For North Augusta High School, he scored 15 touchdowns as a member of the 10 th  grade team in 1966 and was voted the “Most Valuable Scrub” or better known as the 10th grade MVP.  Beginning in his 11 th  grade season, Gerry began tallying rushing yardage that would eventually earn him a college scholarship. He was chosen Most Athletic in both his sophomore, junior and senior years as a Yellow Jacket.  Voted the Augusta Shriner Back Award as a junior, he broke the NAHS single season rushing mark with 1,257 yards as a senior to bring his high school career to 1,863 yards.  He also scored 8 touchdowns in each of his junior and senior years.  Gerry was the co-captain, selected Most Valuable Player, the STAR Player of the Year, CSRA Back of the Week and selected for the Big Nine All-Star team.  He was also named in Who’s Who 1968 South Carolina athletes.",
    "p4": "Gerry signed an athletic scholarship to The University Southern Mississippi Golden Eagles to join fellow HOF member Hugh Eggersman, future NFL great Ray Guy and Aiken’s Wilson Plunkett.  He was signed as a halfback and kickoff and punt return specialist.  His punt return of 60 yards for a touchdown helped lead Southern Miss to an upset win over 5 th  ranked Ole Miss and Archie Manning.  He was the leading punt returner on the team in 1970 and also made the Big Gold Coaches Honor Roll in 1973 and the USM Dean’s List in 1974 with a 4.0 GPA.",
    "p5": "After an offer to go to camp for the New Orleans Saints, Gerry became a teacher for 31 ½ years with Richmond County.  He was the Head Football coach for 3 years and an assistant for another 9 with Butler High School while also coaching baseball, track and golf.  He was a member of the coaching staff at NAHS during the State Championship year of 1989 while also helping the baseball and softball team for the Yellow Jackets.  His time at North Augusta remains the highlight of his coaching career.",
    "p6": "Gerry spent 28 years as a Georgia High School football official and 15 years as a softball umpire for GHSA and GISA.  He officiated several state championship football games in Georgia included some played at the Georgia Dome.",
    "p7": "Gerry is married to the former Sherilyn Hunt, her brother was George Hunt a teammate of Gerry's at USM, and has two children.  Son Gerry and daughter Stacey (Usry) also played sports at NAHS.  They have 7 grandchildren, three of which are current athletes at North Augusta High School.",
    "p8": "Gerry continues to attend athletic events supporting his grandchildren and will always be in our community.  Now a Hall of Famer, he will be remembered as an outstanding player, coach, father grandfather and devoted alumni of North Augusta."
}