{
    "p1": "Hubert Morris was born in Olar, South Carolina, attended Olar High School, Newberry College and received his Masters Degree from Appalachian State University. He held his first coaching position in Blackville as the girls basketball coach and spent the next 51 years in the coaching ranks and as a History and Physical Education teacher. He is a veteran of the US Army and was stationed in Korea. Morris arrived in North Augusta in the 1957 school year to become the first middle school football coach in the community, staying there for 9 years. His 46-13-6 record included three consecutive undefeated seasons and four overall while coaching many of the great football players our community has been blessed with for so many years. He also coached the boys basketball team for those nine years during his stay at Paul Knox Middle School.",
    "p2": "1966 brought the position as Head Football Coach at Strom Thurmond High School. His six year tenure included one State Championship over Laurens, one runner up the following season losing by just one point to Winnsboro and 3 Region Championships. He left with an impressive 54-13-2 record. During this time he married Bonnie Dillard of Edgefield.",
    "p3": "Upon Jim Buist retiring at NAHS, Coach Morris assumed the Head Football position in 1972 and remained there for 15 consecutive years. His teams earned 5 Region Championships while compiling a 91-71-2 record. He remains the winningest coach in North Augusta High School football history.",
    "p4": "After leaving North Augusta, a two year absence from coaching brought him to Augusta Christian High School for 5 years. He then moved to Wardlaw Academy as an assistant to Jim Buist for two seasons before taking over as Head Coach in 1996. An incredible 13 year run netted Coach Morris 4 State Championships, 1 State Runner-up, 5 Region Championships and 2 Region Runner-up finishes. He amassed 106 wins against 53 losses when he retired from coaching at Wardlaw.",
    "p5": "His overall record of 264-166-4 includes South Carolina Coach of the Year 5 times, a four time All Star coach (winning 3 of them), twenty playoff seasons, a 28 game winning streak, five undefeated seasons, twenty three winning seasons and 39 seasons as a Head Football Coach.",
    "p6": "The Hubert and Bonnie Morris family includes two children, Brent Morris and wife Monica and Brantley Bober with husband Jason, and four grandchildren, Bryce and Riley Morris and Braden and Baylee Bober. As a lasting tribute to the four State Football Championships he led Wardlaw Academy to, the football field was dedicated on October 23, 2009 and will forever be named “Hubert Morris Field”."
}