{
    "p1": "A native North Augustan, Hugh Eggersman had a stellar football career at the high school and collegiate level. As a three year starter for the North Augusta Yellow Jackets, he was outstanding on both sides of the ball as well as the team punter. The two-time Star Player of the Year was named outstanding defensive player as a sophomore. Prior to his senior season, he was named as one of the Top 100 Running Backs in America, a list that included future NFL Hall of Famer Franco Harris.",
    "p2": "A powerful running back and fierce defensive lineman, he was selected to the Easley All-State Team, Columbia All-State Team nose guard blocked punt and td, the Prep All- American Team and participated in the 1967 Shrine Bowl as a running back. Hugh’s appearance in this game marked the thirteenth consecutive year a member of the North Augusta football team had been selected for this honor. He completed his high school career with 1995 rushing yards on 419 attempts and 25 touchdowns.",
    "p3": "Several college recruiters came calling and in December, 1967, Hugh signed a letter to attend the University of Tennessee. He later changed his selection to the University of Southern Mississippi. An Assistant Coach for Tennessee, P. J. “Bear” Underwood accepted the head job the next year at Southern Mississippi. Hugh spent the first two seasons splitting playing time as a linebacker until “Bear” had a talk with him and moved him to defensive end. He became a two year starter and continued to be recognized for outstanding play at this tough Division I position.",
    "p4": "On October 17, 1970 the #4 ranked University of Mississippi team led by Archie Manning came to the USM campus as a big favorite after beating the Southerners 69-7 the previous year. Suffering a sprained ankle in the first half, Eggersman limped to the sidelines and had the ankle taped so he could get back in the game. He turned in the best performance of his career by making seven solo tackles, assisted on four others and twice sacked Manning for losses totaling 16 yards. He batted down one pass and intercepted another. And to complete the day, he stopped the future NFL star on fourth and one at the USM one yard line to preserve the win. He was named national Outstanding Lineman of the Week for his role in one of the biggest wins in Southern Mississippi football history.",
    "p5": "Eggersman played with another future NFL great in Ray Guy and former NA Yellow Jacket Gerry Saggus. Hugh was selected to the All-South Independent Squad as a first team defensive end in his junior year and second team his senior year.",
    "p6": "After graduation, he spent several years in Mississippi before returning to the North Augusta area where he remains today. He was a salesman for many years and involved in barrel race horses with his daughters before beginning work at SRS in 1983. He retired in 2007 and you can now find him taking care of the Yellow Jacket football field. Hugh married Priscilla Burbank on November 3, 1979 and has five married daughters; Cindy, Tracy , Jennifer, and twins Leighton and Whitney. In 2010 he was honored with the Bill Wade Unsung Hero Award from Southern Mississippi recognizing his contribution to USM football."
}