{
    "p1": "Golf has been an important component of the sports history of North Augusta. There have been, and are, many fine players that call North Augusta their home. And one of the most successful golfers over the last 30 years has been Jeff Pope.",
    "p2": "Born August 7, 1965 to James and Elizabeth Pope, Jeff learned the game from his father and grandfather who were both fine players having shot their age on numerous occasions. Around the age of 12, Jeff sharpened his skills at North Augusta Country Club. The facility was always friendly to junior golfers and offered a challenging and safe place to play the game against some great competition.",
    "p3": "There were many days of an early drop off and rounds of golf of 36 and even 54 holes in a day. Only the setting sun was able to get him and his playing partners off the course until tomorrow. Jeff never had a professional lesson until his mid-30’s, instead grooving his swing through repetition and competition. A member of the two-time State Champion North Augusta Yellow Jacket squads of 1982 and 1983, Jeff led his team to both Region and State Championships including the Southern Cross Tournament at nearby Palmetto Golf Club completing an undefeated season and a record of approximately 75-0. He was named to the All-State team as a senior in 1983 before heading off to Spartanburg Methodist to continue his golf career. He also played for USC-Aiken after completion of the Spartanburg program.",
    "p4": "Over the next 20 years, Jeff captured 12 Club Championships at both North Augusta Country Club and The River Golf Club of North Augusta. In 2000, he qualified for the US Mid-Amateur held at the Homestead in Hot Springs, VA. The winner of this tournament is given an exemption into the Masters Golf Tournament.",
    "p5": "Jeff continued his fine play with an especially successful run beginning in 2012. He was named the Player of the Year in the Regions/Peak Amateur Series in 2012 and 2013 winning 14 Regions/Peak events, the current all-time record. He also holds the point record with 475 that included 5 wins and two runner-up finishes. His victories included the Augusta City Amateur. He was twice winner of the SC over 40 division, individual medalist at the 2012 South Carolina State 4-ball Championship with Ben Lown and team winner in the 2013 SC Trescott Championship again with Lown and Justin Thompson. His current handicap of +1 is very close to his all-time low of +4 of a few years ago. There are many more opportunities for Jeff to win and compete at the highest amateur level in the CSRA. His future goals include to qualify for the US Senior Open and Amateur, win the State Senior Amateur and Open and win the Augusta City Senior Amateur.",
    "p6": "Jeff is married to wife Ginger and has 3 daughters; Katie, Heather and Ashley. He has a brother Mike and sister Christina. Golf is truly a lifetime sport in which Jeff continues to excel. As a North Augustan, his name will always be mentioned as the best to ever play the game from our community."
}