{
    "p1": "Athletic success can be measured in many ways, by individual and team success, by winning records and by natural ability. Jerry Priestley can be measured in all three areas. A natural athlete, Jerry was a standout in three sports in high school and college. At North Augusta, he was a three sport letterman in football and four year starter in baseball with a 20-5 record and basketball, averaging 27.0 ppg his senior season. He was the first 9 th grader in history to play on the varsity Level. His accolades include being a member and MVP of the 1960 Shrine Bowl Football team, a member of the Orlando Sentinel All Southern High School Football Team, 1960-61 CSRA Inaugural Augusta Herald CSRA Player of the Year and 1961 South Carolina All Star Basketball Team.",
    "p2": "Upon graduation he was offered scholarships to many major colleges, as well as a professional baseball contract with the Pittsburgh Pirates, accepting a scholarship to Georgia Tech because they would permit him to participate in three sports. He excelled in football, baseball and basketball in Division I competition. Lettering all three years in all three sports (freshman were not eligible), he was a key man for every team, as a starter. His accomplishments included being selected as MVP in the annual Spring Game of 1963 as well as a member of the 1962 Bluebonnet Bowl vs. Missouri and the 1965 Gator Bowl team that faced future Green Bay Packer Donnie Anderson. Jerry played quarterback that game, as well as kicked his team to a 31-21 victory. The next day he was in Atlanta practicing with the basketball team and on Monday played for Tech against arch rival Georgia. He was the total offensive leader of the 1964 football squad and competed in the 1963 Milwaukee Classic and 1964 Sugar Bowl Classic basketball tournament while with Georgia Tech.",
    "p3": "Jerry remains in the top 12 at Georgia Tech in career punting average at 39 yards per kick in an era that subtracted 20 yards when a punt went into the end zone. His lifetime ERA of 1.71 remains in the top 12 in career ERA as a pitcher for the Yellow Jackets that compliments his 9-1 record. He was inducted into the Georgia Athletic Hall of Fame in 1982 as a three sport letterman. Jerry was the first player to accomplish this feat since 1939 and only the fifth Georgia Tech overall. Since his playing days, no other player has achieved this milestone and he will most likely be the final player so recognized.",
    "p4": "Upon graduation, he was offered a contract to play for the Oakland Raiders. He decided to return to Georgia Tech, at the request of Coach Bobby Dowd, to coach the freshman football team and earn additional graduate credits. He was also nominated as a Rhodes Scholar and remains loyal to the university today, residing in the Atlanta area. He will always remember North Augusta as his home."
}