{
    "p1": "Samuel James Buist spent his secondary school years in Blackville, SC where he played football, basketball and baseball for 3 years at Blackville High School. He attended Clemson University and received a degree in Science and Secondary Education.",
    "p2": "In 1952 he received a Second Lieutenant's commission and was assigned to the armor school at Fort Knox, Kentucky. After Fort Knox he was assigned to advanced armor training at Fort Hood, Texas. Six months after graduation he was sent to Korea in the 140th Tank Battalion. He was a recon platoon leader, the platoon consisting of a rifle squad, an 81 mm mortar section, two light tanks and a scout squad with two jeeps. His commander was the son of General George Patton of WW II fame.",
    "p3": "Jim's next assignment was with the reserve unit in Aiken, SC. During this time he earned a Masters Degree from the University of South Carolina and married wife Anne in 1954. He was interviewed by Ed Stillwell and Cally Gault and accepted a coaching job at North Augusta High as basketball coach and assistant football coach for the 1955-56 seasons. When Coach Gault accepted the head coaching job at Presbyterian College in Clinton, SC, Buist was hired as head football coach and Athletic Director for the next eight years. After he coached the JV football team on a voluntary basis with help from Sammy Anderson, Joe Barrs, Leo Boehmer, Jimmy Mumford, Ben Watson and Jon Williams. Five of the six years the JV team went undefeated.",
    "p4": "In all his years at NAHS he taught five chemistry classes with thirty students in each class. It is doubtful that any head coach in a school the size of NAHS had such a class load. The students dedicated the yearbook \"Sandspurs\" to Jim two times. The students at NAHS were always very important to Coach Buist and he considered it a blessing to work with so many fine students.",
    "p5": "After retiring from NAHS, he coached at Saint Angela in Aiken for three years. His next stop was Wardlaw Academy where his teams played for the SDCISA State AA Championship six of the eight years he was head coach. His last coaching job was at Curtis Baptist High School in Augusta, GA.",
    "p6": "During these coaching years he stayed in the Army Reserves and retired as a full bird Colonel in 1990. He traveled all over the United States as an evaluator for regular armor units. Some of the stops were Camp Drum, NY; Camp Blanding, FL; Fort Benning, GA; Fort Leavenworth, KS and Fort Gordon, GA. His last few years in the Army Reserves, he taught in the command and general staff college. He also taught many regular army officers at Fort Gordon and the University of Southern Mississippi.",
    "p7": "For over 25 years his favorite hobby has been to put up a large amount of Christmas decorations each year. Even though there are those who attempt to compete, no one in North Augusta can compare with his light show. It gives him great pleasure to see so many young people telling him how much they look forward to seeing his home each year.",
    "p8": "A short list of his honors include being chosen in 1960 as the head coach and again in 1968 as the defensive coach in the North/South All Star football game. Four of the eight years he coached at Wardlaw Academy he was chosen as the North's head coach in the SCISA All-Star game. In 1983 he was chosen as the SERTOMA Club's \"Service to Mankind Award\" recipient."
}