{
    "p1": "Johnny Harrison was a three sport athlete at North Augusta High School. Football, basketball and baseball excellence are all part of the Harrison athletic resume. Born November 23, 1957 in Augusta, GA he lived in North Augusta until graduating from college. As a football player, he spent time at tight end, linebacker and punter. A captain for the 1974 Jackets, he averaged 15.9 yards per reception playing for Coach Hubert Morris. He was selected to the All-State team as a linebacker and participated in the Shrine Bowl with past inductee Pat Collins. Johnny was a three year basketball player, competing at center. He was team captain in 1974-75, averaging 14.1 points per game for the Jon Williams coached Jackets. He was selected as the team MVP in both 1973 and 1975.",
    "p2": "Baseball was to be the sport that Harrison would take to the collegiate level. He played on the 1973 American Legion State Championship team. As a Yellow Jacket, Harrison played 3 years for Coach Rod Greenway at right field and first base. He was captain in 1975 rounding out a three sport leadership role. He finished with a career .355 batting average.",
    "p3": "After graduating from North Augusta, Johnny played baseball at USC-Aiken in 1976 and 1977. In his final year at USCA he compiled a .317 batting average that included 25 RBI, 2 home runs and was selected as the team MVP. Harrison transferred to Francis Marion University for the 1978 and 1979 seasons. In 1978 he batted .302 in 37 games with 23 runs scored, 7 doubles, 2 triples, 6 home runs, 24 RBI and 6 stolen bases in 7 attempts. Francis Marion was 27-11 that season, including wins over Clemson, Yale and Western Carolina.",
    "p4": "In 1979, he batted .301 in 38 games with 30 runs scored, 9 doubles, 4 home runs, 38 RBI and 10 stolen bases in 11 attempts. His combined totals , 301 average, 68 RBI and 10 home runs. He was named to the NAIA District Six All-District team and to the 1979 All-State team. The Patriots were 31-7 that season, including wins over South Carolina, Virginia, George Mason, Baptist College, Furman and Western Carolina. He was a team co-captain for the 1979 season.",
    "p5": "Johnny Harrison graduated in 1980 with a BS degree in mathematics. He married the former Peg Jeffers of Florence, SC in 1983 and has one daughter, Christy and one sister Dee McLane who lives in Edgefield, SC He currently works as a salesman and lives in Mt. Pleasant, SC",
    "p6": "There is no way to list all who had a positive influence on my career. I was blessed to play for coaches that were not only great coaches, but great people.\" His coaches all felt the same about him, a model player, team player and gifted athlete."
}