{
    "p1": "John “Fuzzy” Floyd was an outstanding baseball player and umpire for many years. His first baseball success came as a member of the 1959 Dixie Boys Baseball team that represented South Carolina in the Dixie Boys World Series in Lakeland, Florida, “the best baseball team I’ve ever played on”.",
    "p2": "A standout athlete at North Augusta in football, basketball and baseball, he attended Georgia Military College on a basketball/baseball scholarship. While there, he was voted most valuable player in both sports. In the summer, Augusta College contacted him to return to the area and he accepted, playing both sports for the Augusta College Jaguars.",
    "p3": "Fuzzy attended a major league baseball tryout in the summer of 1966 and was offered a contract by the Pittsburgh Pirates as a pitcher. He was sent the next day to the Class “A” Gastonia Pirates and completed the season. In 1967 he was assigned to Clinton, Iowa and was selected to the Midwest League All-Star team as a relief pitcher. His third professional season was split between Clinton and the “AA” Ashville Tourists of the Carolina League. An arm injury shortened the season and an additional year with the Kansas City Royals Class “A” team from Waterloo brought his professional playing career to a close in 1970.",
    "p4": "Fuzzy worked for the Augusta Engineering Department in the off season while playing baseball in the summer. After baseball, he enrolled in the Army National Guard and completed a 25 year career as an E-7 Sergeant First Class. Personal circumstances required him to have a third job and he chose umpiring. Starting out in Little League, he worked his way up to Pony, High School, American Legion and college. He also worked high school and recreation league basketball.",
    "p5": "John’s work ethic advanced his umpiring career at a rapid pace. He began umpiring college baseball in 1983 and worked the NAIA World Series from 1990 to 1994. He called the 1995 and 1996 Division II World Series, serving as Crew Chief in the latter. He served 3 additional years at the World Series. He has worked more NAIA World Series than any other umpire in the country (10) and was chosen to work in 12 College World Series.",
    "p6": "In 1995, Fuzzy became a member of the Southeastern, Atlantic Coast, Southern, Big South and Peach Belt Conferences and continued umpiring until his retirement in 2005. In 2009, the John “Fuzzy” Floyd Umpires Locker Room at the new $38 M Carolina Baseball Stadium was named for him in Columbia, SC as a lasting tribute to his involvement and success in the game."
}