{
    "p1": "Joseph “Joey” Houston, son of Mary and Joseph Houston, began playing flag football in 3rd grade and progressed through recreation leagues, middle school, junior varsity and varsity football at North Augusta High school.  A two year starter for the Yellow Jackets as a defensive back, Houston was a member of the 1989 State Championship team and joins former player Mathew Campbell and  Coach Bill Utsey in the North Augusta Sports Hall of Fame.",
    "p2": "Also serving as the kick returner, his 9 career interceptions included 3 in one game against region rival Irmo High School.  He was the recipient of the Jon Williams Coaches Award, PK Character award and Frank Rogers Sportsmanship Award.  He was also named to the All South Carolina team by the Augusta Chronicle in 1990. Houston signed to play football at Gardner-Webb University where he was a three year starter for the Bulldogs at defensive back, twice earning All-Conference honors.  The Bulldogs played for the 1992 NAIA National Championship, losing a close game to Central State Ohio 19-16.  He also received the program’s Leadership Award as a senior.",
    "p3": "After a successful athletic career, Houston turned to coaching beginning as a Graduate Assistant at his alma mater, Gardner-Webb, coaching defense, then was promoted to a full-time assistant after one season.  After two years with G-W, he was hired as Defensive Backs Coach at Georgia Southern University under Paul Johnson,, the current coach at Georgia Tech.  During his three years with the Eagles, GSU rolled to an overall record of 37-6 (.860) and berths in the 1998 and 1999 NCAA I-AA National Championship games.  The 1999 squad posted a 13-2 mark on its way to the national championship.",
    "p4": "Houston went on to coach the secondary at Tulane University from 2000-2004 under Chris Scelfo and helped mold the Green Wave secondary into one of the best in the nation in 2002.  That group posted 22 interceptions while leading a Wave team which led the nation in turnovers gained.  The team played against Hawaii in the Hawaii Bowl,  defeating the Rainbows 36-28.",
    "p5": "Moving back to North Augusta in 2004, he left coaching and was employed by Menardi Filtration and currently works for Excel Company.  He has three children with mother Neri that includes son Dennis and daughters Jasmine and Jessica."
}