{
    "p1": "Keith Waters moved to North Augusta in 1959 from Miami, FL with his parents and 3 brothers. Attending North Augusta High School, it didn't take him long to begin to show his athletic talent for Yellow Jacket country.  Keith played three sports in high school, football, basketball and baseball.  He is the second member of his family inducted into the North Augusta Sports Hall of Fame following brother Charlie's induction in 2008.",
    "p2": "His football career included two JV seasons and as the 3rd team QB in 1962 on varsity for legendary coach Cally Gault.  He played one down of offensive football that year, kicking an extra point against Dentsville High. Basketball brought better success where he competed for one season on JV and two seasons on varsity.  His accomplishments included the CSRA All- Tournament team in 1962 played at the Bell Auditorium where the Jackets finished runner-up.",
    "p3": "Baseball being his real passion, Keith was a member of the Palmetto Majors State Champions in 1962 and 1963. He played varsity baseball for 3 years as a shortstop with his team earning state runner-up in 1961.  Upon graduation, he attended Clemson University where his athletic career reached new heights.  Before his graduation in 1968, Waters was a walk on candidate for football, basketball and baseball for the Tigers.  His football career included an invite to camp from Coach Frank Howard as a place kicker and scout team wide receiver.  He tore his ACL in '66, needing knee surgery which ended his football career and affected his upcoming baseball season.",
    "p4": "Keith's baseball career began as the starting shortstop for the freshman team where he batted .343.  He started as the Tigers center fielder from 66-68 and finished with a career .270 mark. Clemson won the ACC championship in 1967.  He also led the ACC in triples in 1968.",
    "p5": "After graduation, Keith entered the US Army and spent the next 20 years in a distinguished career which included Vietnam, graduation from medical school and becoming an Army Flight Surgeon.  He retired in 1968 as a Lt Colonel . Keith was called back to service in 1991 in support of Operation Desert Storm.  Dr. Waters spent 22 years in private practice, retiring in 2010.  Keith is married to wife Debby, has two children, Scott and Kathy.  His two  grandchildren include Hannah Saunders, a sophomore at Clemson and Watson Saunders, a baseball prospect from Blythwood HS."
}