{
    "p1": "Lee was raised in Sumter, SC but considers North Augusta his home town having lived here for the past 54 years. He began his broadcasting career in 1947 following graduation from high school. From WFIG radio, Sumter to Augusta and Chattanooga, TN, he sharpened his sports skills doing play by play and a variety of interviews and announcing duties of all kinds.",
    "p2": "He accepted a position as staff announcer at WRDW-TV in 1956 which proved to be a springboard into his love of sports. Since polio had halted his own dream of a sports career he lived that dream by promoting and supporting young athletes throughout his community. Their success and their growth of North Augusta gave him personal pleasure. While Lee enjoyed sports activities he also took pride in participating in community interests which television stations encourage.",
    "p3": "He is a past President of the Greater North Augusta Chamber of Commerce, during the campaign to build the North Augusta Football Stadium. Former member of the Board of Directors of the Georgia Association of Broadcasters, Past President of the Fort Gordon/Augusta Chapter of AUSA (Association of the United State Army), served on the Board of the CSRA Business League, The Augusta Training Shop for the Handicapped and was equally proud to have served on the Boards of Directors for the Salvation Army, Easter Seals, The Cancer Society and the Augusta Better Business Bureau.",
    "p4": "Lee is a recipient of the Augusta Advertising Club's Silver Medal Award, the Louis Harris Award presented by the Augusta West Rotary Club and is a Brevet Colonel in the Order of the Signal Corps. While continuing his interest and participation in televised sports, Lee found time to grow in his professions. From Operations Manager at WRDW-TV to General Manager at WATU-TV, now WAGT-TV, he retired in 1991 as Station Manager of Channel 26.",
    "p5": "Lee is a childhood friend of New York Yankee great Bobby Richardson. Aside from his family, wife Harriet and four children, Danny, Marjorie, Pat and Keith, his greatest joy has been to contribute as a member of the North Augusta community for which he will always be grateful."
}