{
    "p1": "Leigh Pagan was born in Eureka, California to Barbara and Lloyd Pagan. Shortly after birth, her family returned to her parent’s home town of Trumann, Arkansas where her father worked for Kimberly Clark in Memphis, TN. Her father transferred to Kimberly Clark’s Beech Island, SC plant in 1968 and her family settled in North Augusta just in time for Leigh to start first grade. Leigh soon developed an interest in sports when her older brother, Bryan, began playing little league sports. Leigh and Bryan were always outside playing baseball, football or basketball with all the Hammond Hills neighborhood kids. Leigh began playing softball in the sixth grade with the Belvedere Girls Softball League, the only organized sports league for girls in the CSRA in the mid 70’s.",
    "p2": "Leigh’s outstanding run in athletics began in the 8 th grade playing basketball for Coach Maggie Ward at North Augusta Junior High. Leigh was the team’s leading scorer and was selected All-Conference and team MVP in the 9 th grade. Leigh expanded her athletic career to include participation in volleyball and softball in the 9 th grade, the first year these sports were offered for girls.",
    "p3": "At North Augusta High School, Leigh was a three-year starter and team captain in volleyball, basketball and fast pitch softball earning team MVP honors in all three sports her junior year and repeating as team MVP in basketball her senior year. The southpaw was an excellent shooter leading the team in scoring all three years. Leigh garnered Aiken Standard All-County honors all three years including the Aiken Standard Player of the Year her senior year. Leigh was Aiken County’s leading scorer her junior and senior year averaging over 20 points and 10 rebounds per game. She earned All-Conference honors her junior and senior years and was selected to the South Carolina Coaches Association of Women’s Sports Senior All-Star Team. Leigh also earned All-County honors in volleyball her junior and senior year. In volleyball and basketball, she was coached by Diane Shuler in the 10 th and 11 th grade and was reunited with Coach Maggie Ward for her senior campaign. Leigh played first base for Coach Verne Rushton’s Yellow Jacket Softball team.",
    "p4": "Leigh earned a full scholarship to play volleyball and basketball at USC-Aiken for Coach Johanna Gibbs. The Lady Pacers were NAIA District 6 Champions in both volleyball and basketball her freshman year. She was a four-year starter and team co-captain in volleyball earning All-Conference and team MVP honors two times. In basketball, Leigh was a two-year starter and in her senior year was the team’s leading scorer, co-captain and an All-Conference selection. In addition to her outstanding performance on the court, Leigh excelled in the classroom earning NAIA District 6 All Academic honors in both volleyball and basketball. Leigh was USC-Aiken’s first two sport Academic All-American performer earning the honor in her junior and senior year in volleyball and in her senior year in basketball. She was named USA-Aiken’s Female Scholar Athlete of the Year her senior year.",
    "p5": "After college, Leigh continued her athletic career by participating in Greenville County, SC Recreational and YMCA Women’s and Co-Ed softball and power volleyball leagues. She also competed in both in-door and out-door USA Volleyball tournaments with the UpSouth Volleyball Club.",
    "p6": "Leigh is a CPA having earned a BS in Accounting from USC-Aiken and a Master’s in Tax from Clemson University. She began her professional career as a tax accountant at Ernst &amp; Young in Greenville, SC and eventually moved to the private sector as the Tax Director of an insurance company in Greenville. Leigh is a graduate of Leadership Greenville and has been active in community volunteer and board leadership activities including the United Way, Pendleton Place Children’s Shelter, Rosewood House of Recovery and the Emrys Foundation. She is currently a corporate insurance tax executive for a large publicly traded insurance company in West Des Moines, Iowa."
}