{
    "p1": "Lenny Best played football for North Augusta High School from 1975-77. An outsanding defensiveback and running back, Lenny's career statistics included 410 rushing attempts for 2327 yards and 18 rushing touchdowns plus one touchdown reception. He averaged an impressive 5.7 yards per carry and graduated as the all-time leading rusher in North Augusta history. He is currently 6th on the all-time list. During his senior campaign, he set the school rushing record against Irmo with 244 yards. As a junior, he returned a fumble for a touchdown of 88 yards, the second longest such play in North Augusta history.",
    "p2": "Lenny was selected to the Augusta Chronicle All-Area team, Aiken Standard All-County team and named the 1977 North Augusta STAR Outstanding Player. Best also ran track, performing the 220 yard dash, the 440, 440 relay and the triple jump.",
    "p3": "Lenny went to Wofford College and continued to enter the record books for the Terriers during his 4 year career. As a freshman he had 23 carries for 87 yards rushing. As a sophomore his 164 carries, 1120 yards and 6 touchdowns included six 100 plus yard rushing games.. His 6.8 yards per carry ranked second in the nation for the NAIA Division. His junior season included 897 yards rushing and 7 touchdowns. He concluded his career with another 31 carries and 133 yards. He also had 3 career receptions for 28 yards.",
    "p4": "Lenny led Wofford in rushing yards in both 1979 and 1980. He ranks 14th in school history with 2,237 career rushing yards, 10th with 1,120 in a single season and his single best game of 208 yards against Lenoir-Rhyne in 1979 is ranked 9th all-time. Named Wofford's most outstanding player in 1979, his college accolades include NAIA All-District in 1979 and 1980, NAIA State Player of the Year in 1980 and NAIA honorable mention All-American in 1979 and 1980.",
    "p5": "Lenny Best was selected for the Wofford Athletic Hall of Fame in 1988. While at Wofford, Best became a member of the ROTC and was commissioned as a 2nd Lieutenant in the National Guard during his sophomore year. He had one tour in Afghanistan as a member of the Command Staff retiring in 2010 at the rank of Colonel. He is currently working in Washington DC as a contractor with the Department of Energy. Lenny married his high school sweetheart, the former Jackie Norris and has two children, Jarrod and Lauren."
}