{
    "p1": "Mathew Campbell was born in Heidelberg, Germany on July 14, 1972. He moved to the United States at age 2 and attended North Augusta schools until graduating from North Augusta High School in 1990. As a young man he played baseball and soccer, starting to play football in junior high. A member of the 1989 State Champion Yellow Jackets, he was selected All-State Lineman of the Year and chosen to play in the Shrine Bowl. Hurricane Hugo canceled the football contest but he played in the North South game.",
    "p2": "Mathew received numerous offers to play major college football and chose to become a Gamecock at the University of South Carolina for Coach Sparky Woods. A four year letterman, he was chosen 1994 Gamecock Award winner, played in the 1994 Senior Bowl and invited to the 1994 NFL Combine.",
    "p3": "In 1994 standing at 6’ 4” and playing at 300 pounds, he was signed as a free agent by the New Orleans Saints as a tight end, being placed on the developmental squad. When the NFL expanded in 1995, Mathew was one of the original ten players signed by the Carolina Panthers, played in 10 games and started 2 games during their inaugural 1995 season. In 1996, he was moved to offensive line as a guard and tackle, going on to play in 59 games, starting 56 of them. He was named the Panthers Offensive Player of the Game five times.",
    "p4": "In April of 2001, Campbell was signed by the Washington Redskins as a free agent offensive lineman and played a reserve role as tight end. In March of 2002, he was picked by the Houston Texans in the expansion draft to again play offensive line. He completed his NFL career with 80 games played.",
    "p5": "Mathew began life after professional football as owner of Tree Line Outdoors inaddition to owning Lacroix, a high definition video equipment leasing company. He laterbecame Athletic Director for Cross Episcopal School in Bluffton, SC and served asOffensive Line Coach and Co-Coordinator at Bluffton High School for three seasons.In 2010, Mathew accepted the position of Offensive Coordinator and OffensiveLine Coach with Virginia Military Institute in Lexington, Virginia led by his former USCCoach Sparky Woods. He is an avid sportsman and loves to spend time with his family.Mathew and wife Jeanene have four children, Hunter, Madelyn, Jacob and Mathew Jr.He is the youngest person ever elected to the North Augusta Sports Hall of Fame."
}