{
    "p1": "Ned Baynham's selection into the North Augusta Sports Hall of Fame continues the tradition of recognizing one of the finest athletic families in our history. The youngest of 5 brothers and two sisters, Ned starred at North Augusta High School during the late 1950's and in the glory years of Yellow Jacket football. A three sport letterman, Ned continued his contributions to North Augusta for many years after graduation in 1961.",
    "p2": "Playing football as an end when running the ball was a popular offensive strategy, Ned considered himself an extra tackle, however he was the leading receiver on the team. One memorable moment was when Coach Gault worked his game plan all week against Union High in a spread formation. After three successive unsuccessful pass attempts, they abandoned the pass strategy and returned to running the football.",
    "p3": "Ned was a member of the 1958 State Champion football team and his senior year honors included a selection to the All-Area team, Most Outstanding Athlete at NAHS, South Carolina All-State team, the North/South team and the Shrine Bowl, coached by legendary coach John McKissick. His team won the Shrine Bowl but the most memorable event that week was the visit by players to the Shriner's hospital. \"It changed my life and the way I looked at people forever.\"",
    "p4": "It was uncommon to participate in both all-star football games in South Carolina. Playing for the South team against the heavily favored North squad, Ned played the entire game at either offensive or defensive end, sitting out only two plays, both kick-offs. His team won 7-0 in this August played game and was his start to a very successful senior season.",
    "p5": "Ned was also a three sport letterman on the baseball team that had won the lower state for three successive years. Playing as a first baseman, his versatility as an athlete was evident as a key member of the squad that had tremendous success but unable to capture the state title. His sports schedule was full as a member of the high school basketball team for three years, a feat that is rarely equaled in today's sports environment.",
    "p6": "Ned earned a football scholarship to the University of South Carolina and played his freshman year under coach Marvin Bass and along-side future NFL player and Coach Dan Reeves. Baynham continued to contribute to North Augusta sports for the next 20 years as a football coach at North Augusta Middle School and Paul Know Junior High. His teams were undefeated most years. He moved to NAHS under Coach Jim Buist and the B-team with good friend and fellow Hall of Famer Jerry Priestley and became a defensive coach under Hubert Morris.",
    "p7": "Ned remains active today, employed at SRS and is an avid golfer routinely scoring in the 70's. He married wife Kay in 1983 and enjoys spending time with his children and grandchildren."
}