{
    "p1": "A 1975 graduate of North Augusta High School, Pat Collins was a two sport star for the Yellow Jackets. Basketball was his passion, but he also played football. His sophomore year at NAHS started with Pat not competing on Coach Rod Greenway's football squad. But a few days of watching his friends on the field moved Pat to call coach Greenway and ask to be on the team. He responded by saying he would ask the team.",
    "p2": "The players did let him join the team, but it included extra running before and after practice for a week or two. Pat earned the JV QB position, moving to safety his junior season on varsity and back to QB as a senior, spotting in on defense during certain situations. His team sported records of 9-2 and 11-2 during his final two seasons. Pat was named to the All-South team as a QB and played in the 1974 Shrine Bowl as a running back and safety. Collins led the area in interceptions as a junior with 10, was selected to the All-Area team as a junior and senior as well as CSRA Football Player of the Year and North Augusta STAR Player of the Year as a senior. Pat lettered three years in basketball for three different coaches, averaging 14 ppg and earned All Aiken County honors in basketball as a junior and senior.",
    "p3": "College athletics were also in his future. He became a Georgia Bulldog playing under legendary coaches Vince Dooley and Irk Russell. After playing as free safety and captain on the freshman team, Pat broke his leg and red-shirted his sophomore year. He eventually became the \"Roverback\" being an understudy of team leader Bill Krug at the request of Coach Dooley. Pat played his final two seasons in that position, earning defensive team captain honors his senior season. He participated in the 1978 Bluebonnet Bowl against a Stanford team led by Hall of Fame coach Bill Walsh. Pat completed his Physical Education degree at Georgia and was invited by Coach Russell to join him on his coaching staff at Georgia Southern. He also had some interest as a free agent from professional NFL and Canadian football teams. Instead, he opted to work as a regional salesman for two years before being convinced to join his father in business in Augusta, GA at Georgia State Floral Distributors in 1982. He remains there today, in business with brothers Len and Darrell.",
    "p4": "Pat is married to the former Susan Newton and lives in Thomson, GA with sons Shea and Jeff."
}