{
    "p1": "A native of Abbeville, SC and a graduate of Wofford College, Paul Knox had not only worked at McCormick, but at Langford Station, located in Laurens County, SC and Morrill, Nebraska. He was the third football coach for North Augusta High School, the first coach to have a winning season and the first coach to have an undefeated season. His teams also accomplished 55 consecutive shut-out quarters, still and probably forever a record for North Augusta High School.",
    "p2": "Paul Knox's second season, 1927, was a special year as North Augusta completed not only her first undefeated season, but outscored her opponents 97-0. Starting off with a scoreless tie against McCormick, the Yellow Jackets won their next four games.",
    "p3": "The only thing that stood between North Augusta and her first conference championship was a victory over Edisto Academy, whom North Augusta played to a scoreless tie on November 2. As a result of this game, George W. Wannamaker, the President of the Ninth District, ordered that the two teams play a playoff game on Tuesday, November 6 to determine who would play Batesburg-Leesville High for the District Championship. Coach Lance of Edisto, came to North Augusta on Monday but after many discussions with Coach Knox, they both realized that whoever won the game would face the disadvantage of having to play two important games in one week. After neither coach was willing to withdraw in favor of the other, a coin flip decided that Edisto Academy would play Batesburg-Leesville. Coach Spearman of Johnston High also in attendance, quickly offered to play North Augusta on November 11 as part of the Edgefield County Armistice Day celebration. They fought to a scoreless tie. Two weeks later, the magical season ended with another scoreless tie against Aiken.",
    "p4": "The Paul Knox driven machine did not slow down in 1928, as North Augusta won her first five games by a combined score of 91-0, bringing the unbeaten scoreless streak to 13 games. For the second straight year, North Augusta had the chance to play for the District Championship. This time the obstacle was a strong, unbeaten Aiken team who was entering the game outscoring their opponents 101-6. Plagued by turnovers and a solid Aiken defense, the Yellow Jackets lost their first game in two years 14-0. Even though NA lost, they could take comfort in knowing they cost Aiken the chance to play for the District Championship.",
    "p5": "The 1928 year not only saw the end of the unbeaten and shutout streaks, but the end of Paul Knox's reign as head coach. On the morning of October 31, Superintendent T. J. Lyon suddenly passed away. Knox was chosen to succeed him at the conclusion of the 1929 school year, a position he would hold until 1966. Even though his imprint is seen throughout the community today, it was as a young coach the Knox's influence and character was first felt. After three seasons as head coach, Knox's record was 14-6-4 with an amazing 17 shutouts."
}