{
    "p1": "There cannot be a discussion of the best football player to ever play quarterback at North Augusta High School without including the name Ralph Sapp. A true multi-sport talent he excelled in a wide variety of athletics on the local, state and national level.",
    "p2": "Ralph attended North Augusta schools through the 12th grade. As an 8th grader, he was elected as a high school cheerleader but turned to sports upon reaching the 9th grade and adding some size to his frame. A valued member of the Yellow Jacket squad that included the bulk of the 43 game unbeaten streak, Ralph Sapp was the quarterback of the undefeated 1957 team that was denied the opportunity to compete for the State Football Championship. He was invited to play in the Shrine Bowl All-Star game his senior season.",
    "p3": "Sapp also played basketball for four seasons and made the Augusta Herald All CSRA team. He played baseball for three seasons and also found time to participate on the track and field team for North Augusta, setting the state high jump record that stood for 27 years. He also played on the very first golf team at NAHS during his senior year.",
    "p4": "Ralph later went on to attend the University of South Carolina for two years before beginning a career at DSM Chemicals in Augusta. Golf would continue to be a key sport for Sapp as he joined the Professional Putters Association in 1961. He was twice national runner-up, in 1962 and 1965 for the National Professional Putters Championship. He competed twice on national television for the leading money winners on the Professional Putters Tour. Ralph also contributed to baseball by coaching in the Palmetto Seniors Baseball League as well as a Pony League team for 3 seasons. His 1979 team advanced to the South Carolina State Championship game.",
    "p5": "After a 32 year career at DSM, Ralph continues to enjoy hunting, fishing and golf, several times achieving the rare feat of shooting his age on the golf course. Ralph and his wife Billie continue to reside in the North Augusta area that his children Rhonda, Ralph III and Randy also call home."
}