{
    "p1": "Very few if any individuals are admired more than Randy Cooper. He has touched the lives of countless people, many at the most difficult times in their life. He is not only considered a caring doctor but a dear friend as well. His service to our community is without compare.",
    "p2": "A resident of North Augusta his entire life, Randy grew up in an era of outstanding athletes. Within 30 yards of his boyhood home live 6 members of the North Augusta Sports Hall of Fame. Being a close friend of the entire Baynham family he was considered a brother by many of them spending much time at their home.",
    "p3": "The Cooper family grew up in what some would consider a poor home, but they were taught the value of hard work and doing what is right from their parents. His father ran a garage where Randy worked as a young boy and a young man. He noticed that when the doctors came in to the station, extra care was given to their vehicles, from cleaning the windows to checking the oil. And they often gave a tip of $.25 for good service. Randy knew from the time he was 5 years old that he wanted to become a doctor because they were so giving and respected.",
    "p4": "Sports were a part of Randy’s life including baseball, football and basketball. After some early seasons of high school sports in basketball and football, Randy opted for a job with sports participation coming as an afterthought. However, a life of service to athletics brought him to his induction into the North Augusta Sports Hall of Fame.",
    "p5": "While majoring in Biology at the University of South Carolina, Randy worked as a page for the Speaker of the SC State House, Sal Block. Medical school was spent in Charleston at MUSC with 5 training to include two years in the United States Army followed by Parkland Memorial Hospital in Dallas, TX and ending with Medical College of Georgia in Augusta.",
    "p6": "An accomplished speaker, Randy has been the Chief of Surgery at University Hospital for the past 25 years. He has been involved in local athletics by conducting football physicals for the last 40 plus years all across the CSRA, with his wife Donah working beside him for every one of them. Schools he has given his service to include North Augusta High School, Merriwether Middle, Silver Bluff High, Jackson Middle, Paul Knox and North Augusta Middle.",
    "p7": "Randy Cooper has been honored in many ways by his community and state. He has been selected SERTOMA Man of the Year, Citizen of the Year along with wife Donah and awarded the Order of the Palmetto by Governor Carroll Campbell in 1988, considered the highest civilian honor in the State of South Carolina. It is an honor to include Dr. Randy Cooper as a member of the North Augusta Sports Hall of Fame."
}