{
    "p1": "Rod was born on August 18, 1945 to Gladys and H. P. Greenway in Fort McLellan, Alabama. He is the oldest of four children that grew up in North Augusta. Rod married Lynda Grace McDonald from Jacksonville, FL and they had one son, Happy. He went to his first North Augusta High School football game in the fall of 1950 and he knew one day he would be a Yellow Jacket. Rod was one of the &quot;North Augusta Boys of Summer&quot; that played on one of four Little League teams in North Augusta. It was popular for everyone to have a nickname, such as Reno, Fuzzy, Shirt, Chief, Taz, Peanut, Knocker, Fox, Rosa BB, Little Leo, Moab, Bo and Rabbit. They had umpires named Cally and Slick. For Rod's last two years of Little League he had the highest batting average of .627 and .500. In Pony League, he still holds the record for most homeruns with 14.",
    "p2": "As a child, Rod started school at North Augusta Elementary, continuing to NA Junior High, Paul Knox and NAHS. During his high school years he lettered in football, basketball and baseball and was a member of the 1961 State Champion football team and the 1964 State Runner-up baseball team, both Hall of Fame Inductees. He was recognized as STAR Player of the Week in 1963 and received the Sportsmanship Award the same year. He graduated from South Georgia College in 1966, Georgia Southern in 1969 and received his Master's Degree from Appalachian State in 1977. His two years at South Georgia included All Region and All State as a right fielder while batting .323 and .299. Rod returned to North Augusta in 1969 and took a teaching job at NA Junior High in physical education and Driver's Ed. He was Head Coach of the NAHS baseball team for 10 years, Head Junior Varsity football coach for three years and an assistant varsity coach for defensive backs for 1 year.",
    "p3": "In the fall of 1980, Rod became a supervisor with the Aiken County Transportation Department and stayed there until his retirement in 1999. He later became assistant principal at Greendale Elementary and Belvedere Elementary and Principal at Belvedere from 2002-2009.",
    "p4": "In 1984 he was awarded the Aiken County State Employee of the Year and in 2011 received the coveted \"Service to Mankind\" Award from SERTOMA. Rod has been the \"Voice of the Jackets\" announcing home football games for many years and remains in the position today. With a career over 60 years long and going strong, there is no resident more proud to be from North Augusta and as well liked as Rod Greenway."
}