{
    "p1": "A superb three sport athlete, Sammy Anderson is a native North Augustan who grew up only two blocks from the old football field near the old elementary schools. He participated in the youth football and baseball programs, including the American Legion Post 71 baseball team under long time coach Billy Siegler, where they won several state championships.",
    "p2": "Sammy was a three year starting point guard for the NAHS basketball team coached by Jim Buist that was highlighted by their first ever win over ARC in his senior year. An outstanding baseball player, the speedy catcher was named All-State in his senior year under coach Webster Grayson. But his real accomplishments came on the gridiron for North Augusta and later the University of South Carolina. He was a three year member of the Cally Gault led football team, including the 1958 State Championship team. In 1959, Sammy was selected as the South Carolina Running Back of the Year, the North Augusta STAR Player of the Year, MVP of the NAHS football team, member of the Shrine Bowl as the first team right halfback, played in the 1960 North-South All-Star game in Columbia, SC for the South squad and threw the game winning touchdown on a halfback pass.",
    "p3": "To round out a memorable senior year at North Augusta, he was elected Student Body President, selected to represent North Augusta at Boys State and signed a full football scholarship with the University of South Carolina.",
    "p4": "While at USC, he was the first team halfback for the freshman football team, freshmen were not eligible to play varsity football. He was named the Most Valuable Player on the team. Sammy continued on the varsity level as a 3 year letterman playing on the first team offense and defense. He was a member of the Block C Club and held the ACC record for the single game punt return yardage. Sammy earned the MVP Award in the 1962 Carolina-Clemson game by scoring two touchdowns on long passes from future All-Pro player and NFL Coach Dan Reeves. In 1963 he was named Captain of the USC football team, making North Augusta the only high school in USC history to have back-to-back Captains named.",
    "p5": "After graduating from USC in 1965 earning a BS degree in Secondary Education, he and wife Sara returned to North Augusta where she taught Senior English at NAHS for 33 years. Sammy continued his athletic career where, along with Dick Day, founded the Augusta Eagles semi-pro football team as a player and coach. He began his business career at Belk Department Store for fellow inductee Harry Howard and presently owns ChemDry of CSRA working with his youngest son Chris. Son Sammy also lives in North Augusta and owns Anderson Photography. Daughter Ashlyn lives in Mt. Pleasant, SC where she teaches at West Ashley High School.",
    "p6": "Sammy is a charter member of the North Augusta SERTOMA Club and remains in playing shape through long distance bicycling, golf and working out at the North Augusta Activities Center. A true gift to our community, he has remained a North Augustan his entire life."
}