{
    "p1": "Samuel Warren Twiggs IV, better known as Sammy, was born and raised in North Augusta. An alumni of Hammond Hill, Paul Knox and NAHS, he was a three sport star competing in football, basketball and baseball for the Yellow Jackets.",
    "p2": "A 1985 NAHS graduate, Sammy earned CSRA All Area Football Honorable Mention as a junior and All County team, STAR Player of the Year and Offensive Player of the Year as a tight end during his senior campaign. He was a three year varsity member of the basketball team, serving as Team Captain and a starting right fielder on the baseball squad. Sammy was recognized as the West Augusta Rotary Club North Augusta Male Athlete of the Year for the 1984-85 season.",
    "p3": "Football would be his focus for the next five seasons after high school. Given the opportunity to play for Presbyterian College, he also considered an offer from a family friend, the Offensive Coordinator at Georgia Southern University as a “preferred walk- on”. This family friend was Paul Johnson, currently the Head Football Coach at Georgia Tech. The Head Coach of the team was the legendary Irk Russell.",
    "p4": "As a red-shirt tight end, GSU won the National Championship in 1985. During his freshman season, he was converted to the defensive line and they again won the National Championship. The following two seasons found Sammy competing as an offensive tackle where the Golden Eagles became a 1987 national quarter-finalist and National runner-up in 1988. Converted to a center, he anchored an offensive line that earned him his third national championship in five years. The five year record of 60-13 includes the undefeated 1989 season, 31 career starts including the last 30 of his career and twice recognized as Offensive Player of the Week. Sammy was selected as the National Championship Game Army “Be All You Can Be” Player of the Game.",
    "p5": "Upon graduation from college, he began a sales career in Augusta. Golf became his passion and he began a friendship with PGA Tour member Dillard Pruitt. He became an Assistant Pro at Green Valley Country Club and Greenwood Country Club in 1993. Sammy passed his playing test in 1994 as low qualifier at Midland Valley Country Club and eventually became PGA Head Professional at Greenwood CC in 1996.",
    "p6": "Sammy is married to the former Claudia Funderburk and has two daughters, Madison age 15 and Mabrey age 10. Both girls are active sports participants. He and his family currently reside in the Richmond, Virginia area."
}