{
    "p1": "Stephen (Steve) Mixon, son of Ann and John Mixon, was born on August 14, 1976. A part of the North Augusta community his whole life, he attended both North Augusta Elementary School and Paul Knox Middle School. It was in these early years that Mixon began to develop a love for sports, starting to play football, basketball, and baseball. He continued this love for sports in high school, where he continued to play football, basketball, and baseball at North Augusta High School. He was able to play for the school until his graduation in 1995. However, his heart truly lied with football, which he was able to continue at the collegiate level.",
    "p2": "Mixon signed a football scholarship with the University of South Carolina, a D1 institution, his final year at North Augusta. Of the 1995 North Augusta High School graduating class, Mixon was not the only one to sign a D1 scholarship. Eight or nine of the senior football players at the time were able to secure D1 scholarships. Mixon shared that this was a special team, and that year it seemed as though “everything came together, even when we didn’t think it would, for a lot of guys who cared a lot about each other.”",
    "p3": "During his time at the University of South Carolina, he made the Freshman Year SEC Team Register. Mixon shares that one of his favorite moments of his collegiate career was scoring the winning touchdown against the University of Georgia his freshman year. The year previously, the University had contacted Mixon about recruitment, but it did not work out. Mixon stated that scoring that touchdown was a huge moment of personal success for him, as well as a nice moment for the entire University of South Carolina team.",
    "p4": "Mixon now lives in Atlanta, Georgia with his wife Shameia Mixon. They have three daughters, whom are named Logan, London, and Layla. He works as a fixed operations specialist for a company called “Dealer Tire”. When asked about his favorite memory of being at North Augusta, Mixon stated that he was always grateful for the amount of help offered to students. He stated that if help was needed, it was there. The entirety of the teachers and staff at North Augusta worked hard, and continue to work hard, to ensure that students can achieve their fullest potential both inside and outside of school. When asked how he felt regarding his induction, Mixon stated that it brought him back to going to North Augusta football games when he was younger. He stated that being able to watch the players, become one of them as he grew up, and now become inducted into the Hall of Fame, has been a full-circle moment."
}