{
    "p1": "North Augusta has seen some very good basketball players. The name of Tyrone Walker is always included in the discussion and recognized as the very best ever by many.  An exceptional athlete his entire life, he shared the spotlight with his older brother Roosevelt who often was recognized as the MVP on every rec team he ever played on and was a major influence in Tyrone’s life.",
    "p2": "As a JV basketball player, Tyrone was chosen as the MVP on their 12-0 perfect season.  Moving to varsity as a junior he earned Most Improved Player and All Region honors while the team was crowned Region Champs and went to Upper State Championship game.",
    "p3": "Tyrone’s senior season was highlighted by Team MVP, All Region and All State honors and the team returned as Region Champs.  He was the Runner up AAAA Player of the Year while the team set the boys school record of 25 wins in a row, finishing 25-3 and holds the best boys basketball record in school history.",
    "p4": "Tyrone attended Prep School New Hampton Prep and was a McDonalds Mentioned All American before attending Winthrop University on a basketball scholarship. His college career is full of accolades including Big South Rookie of the Year 2001, Big South conference champs 2001 and 2003, Big South regular season champs 2002 and 2003, Big South 1st team all conference 2002 and 2003, NCAA tournament appearance 2001 and 2002, all tournament team for Brothers Shoot-out at Winthrop University 2003, MVP at Brothers Shoot-out Tournament 2002 at Winthrop University, All tournament team NABC classic Madison WI 2002, All tournament team Arizona State Classic Temple AZ 2004, 2004 pre season pick Player of the Year, Big South second team all conference 2004, Selected to top 3 All time Greatest Winthrop Players online poll and selected to the top 100 college undrafted players in 2004.",
    "p5": "While pursuing his dream of a pro basketball career, he received a tryout for Charlotte Bobcats and interest from the Miami Heat.  He received numerous offers from NBA D league teams and played with CABD Madrid Portugal for one season in the Euroleague.",
    "p6": "To continue his love and give back to the game, Tyrone has been an AAU Coach since 2006 with Team Truth , Southern Stampede, Georgia Stars and now currently with Upward Stars coaching 6/7 grade girls.  He also assisted the Strom Thurmond Rebels boys basketball team for 2 years 2016 /17 season. Tyrone makes North Augusta his home and will continue his coaching legacy for many years."
}