{
    "p1": "Vicki Mann was born in Augusta, GA to Lindy and Jean Mann. Two older brothers Mike and Steve no doubt had an influence on the athletic career of one of the outstanding female athletes in North Augusta history.",
    "p2": "A multi-sport star, Vicki played as many sports as possible including basketball, tennis, volleyball, swimming and softball. Her earliest success came at basketball. Vicki was a member of the 18-0 undefeated ninth grade team that remains one of her best memories of sports accomplishments. Her high school career was full of honors and awards including basketball, tennis and volleyball. As a junior, she was selected most improved volleyball player as well as MVP on the tennis and basketball squads. As a basketball star, she was selected for the All Aiken County team for 1974 and 1975 and a member of the North Augusta All-Tournament team.",
    "p3": "Her tennis accomplishments include City runner-up as a sophomore and two time champion in singles, mixed doubles with John Fleming and doubles with Jenny Quarles. The volleyball team finished as the state runner-up in 1974. After being selected MVP of the volleyball team, there was no doubt who was the most talented female athlete of her time in North Augusta. During her senior year, she was the MVP for all three sports of tennis, basketball and volleyball.",
    "p4": "Vicki attended the University of South Carolina where she continued her volleyball excellence. She earned a spot on the team as a walk-on candidate, was selected the most improved player as a freshman and earned an athletic scholarship for her final three years. Vicki was selected All State and was a member of the State Championship squad of 1976.",
    "p5": "At USC, she continued proving her athletic versatility by winning the Coaches Award in college softball in 1976 and was a member of the State Champion team that qualified for the Women's College World Series in Omaha, Nebraska. Her major influences in her athletic career includes, \"My parents and brothers, who encouraged me to play sports, junior high basketball coach Mrs. Pat Tousant when we were undefeated and Ray and Lyn Fleming, where I spent many hours playing basketball in their back yard until our parents built a court in our back yard.\" Vicki now lives in Decatur, Georgia and works as a Project Manager for Nuance Communications, Inc."
}